[
        {"fullText":"About the job\nThis is a full-time, on-site Senior Full Stack  role located in New Cairo. The Senior Full Stack  will be responsible for back-end and front-end web development, software development, and creating and implementing Cascading Style Sheets (CSS). Day-to-day tasks include programming, debugging software, analyzing business requirements, and collaborating with cross-functional teams.\nBenefits:\n- Competitive Salary\n- Social Insurance & Family Medical Insurance.\n- Semi-Annual Bonus. \n\n- Hybrid work environment after the successful completion of the first 6 months. \n\n\n\nCompany Description\n\nEGID is a subsidiary company fully owned by the Egyptian Exchange. For over 20 years, EGID has been the sole aggregator and authorized distributor of the Egyptian Exchange’s listed companies’ information. In addition to providing fundamental and background data of listed companies, EGID develops software solutions for different business areas such as camping centers and hotel reservations. EGID also acts as an Application Service Provider (ASP) by hosting brokerage firms’ servers. EGID’s world-class data center provides colocation and hosting services to over 120 clients.\n \nRole Description\n\nThis is a full-time, on-site Senior Full Stack  role located in New Cairo. The Senior Full Stack  will be responsible for back-end and front-end web development, software development, and creating and implementing Cascading Style Sheets (CSS). Day-to-day tasks include programming, debugging software, analyzing business requirements, and collaborating with cross-functional teams.\nMain Job duties\n\nAnalyze system requirements and prioritize tasks\nWrite clean, testable code using .NET programming languages\nDevelop technical specifications and architecture\nTest and debug various .NET applications\nReview and refactor code\nDeploy fully functional applications\nUpgrade existing programs\nSupport junior s’ work\nDocument development and operational procedures\nQualifications\n\nStrong experience in Full-Stack Development, Software Development, Back-End Web Development, and Front-End Development\nProficiency in object-oriented programming languages such as C# and Visual Basic .NET\nExperience using programming frameworks such as Angular.\nWork experience as a .NET \nProficiency in building web-based applications\nFamiliarity with agile environments.\nKnowledge of SQL Server and experience with relational database design and stored procedures\nFamiliarity with cloud platforms such as Microsoft Azure or Amazon Web Services (AWS)\nAbility to communicate and collaborate effectively with cross-functional teams including project managers, designers, and s\nStrong problem solving and troubleshooting skills\nBachelor's degree in Computer Science or related field\n","isSuitable":false},{"fullText":"About the job\nTechnical Experience Requirements:\n\n3+ experience in hands-on development in OSB 11g.\nWorking experience in creating Proxy and Business Services.\nWorking experience on various technology adapters (like File\/FTP, DB, JMS\/MQ\/AQ, Oracle Apps).\nWorking experience in designing and creating WSDLs and XSDs.\nWorking experience in Fault handling at various stages.\nWorking experience in designing and creating complex Message Flows as per requirement.\nWorking knowledge of Best Practices in OSB.\nWorking experience in various OSB activities.\nWorking experience in XSLT and XQuery.\nWorking experience in enabling OSB Logging, Reporting and Message Tracking.\nWorking experience in deployment and migration to different environments.\nWorking experience with SOAP\/REST based web services.\nWorking experience in creating and implementing Secured OSB services.\n\n\nJob Responsibilities:\n\nExperience in creating Detailed Design documents, working on development and performing code reviews.\nExperience in direct client interfacing role, understanding the client’s requirements and providing solutions independently.\nImplementing validation and support activities in line with architecture requirements.\nParticipating in detailed requirement analysis and knowledge management activities with the team.\nProviding thought leadership within the area of technology specialization.\nProblem solving, thinking practical implementable solutions.\nDebugging and fixing issues that may appear in different pieces of integration.\nGood Communication skills.\nExperience in working in a team environment.\n","isSuitable":false},{"fullText":"About the job\nScope Of Work:\n\nGenerate sales leads and determine qualified leads.\nSchedule demo meetings with potential clients (Online)\nClose sales opportunities, explain product and service capabilities, and overcome them.\nobjections, and sign contracts.\nMaintain a professional company image at all times.\nAchieving the target of Appointments per day.\nAchieving the target of Contracts per month.\nControl Data and update CRM and reports on a daily -weekly – monthly basis.\n\n\nRequirements:\n\n2-3 years of sales\nSoftware background is mandatory\nSuper deal closer\nSuperior sales and negotiation skills\nAble to achieve monthly targets\nVery Good MS Office, and CRM experience.\n\nWork Conditions:\n\nBasic Salary + KPIs + Commission + Transportation + Yearly Bonus\n","isSuitable":false},{"fullText":"About the job\nCOREations is seeking a talented and creative Technical Team Lead to join our team\n\n\nWork Location: Mansoura, Dakhlia (full-time from the office)\n\n\n\nJob Description & Requirements:\n\n\n\nBachelor's degree in Computer Science, Computer Engineering.\n7+ Years of experience in software development using .Net technologies.\nAt least 1 year of experience as a team leader or similar position.\n\n\nRequired technical experience: \n\n\n\n.NET CORE, C#, ASP.NET MVC using .NET Framework.\nEntity framework code first.\nJavaScript\/jQuery.\nWeb Services and Web APIs.\nMS SQL Server and databases concepts\nGood understanding of modern software development practices and design patterns. Must have an in-depth understanding of all layers of a solution’s architecture. Experience in both architecture and implementation-level software design\nArchitect a .NET solutions.\nFamiliarity with Azure DevOps portal.\nFamiliarity with source control systems: GIT & TFS.\nExperience in CMS systems, Umbraco, or similar.\nExperience in a cross-platform mobile development framework is a plus.\nAbility to mentor and support junior s.\nExperience in requirements capture, analysis techniques, and process improvement approaches\nAbility to follow\/create\/contribute instructions and work in a team environment.\nParticipate in the estimation of new features and components\nAssist in monitoring the status of developing software; write, review, and revise project requirements and specifications.\nDocumenting design and technical specifications for components.\n\n\nInterested candidates can send us their CV to:\n\n\nEmail: cv@coreations.com\n\n\n\nFor more information about COREations, please visit our website: www.coreations.com\n","isSuitable":false},{"fullText":"About the job\nWe are an 800+ strong team whose ideas underpin successful exits, IPOs, strong financial results, competitive advantages, novel processes, new business models, and great user experiences. We focus on e-commerce, travel, mobility, transport, and logistics, while always keeping an eye on emerging segments.\n\n\nWe rethink processes, business models, and architecture, not to mention tech stacks. This approach opens doors for our people to find their own ways and solutions and bring their ideas to life, learning and advancing within and across teams and departments.\n\n\nWe say no to office politics and pointless meetings. We celebrate curiosity, experimentation, and passion beyond code. We are open to people growing within and beyond their teams and departments. This is where we suggest starting today.\n\n\nIn this role, you will\nBuild and scale high-performance backend systems, primarily using Python programming language and ecosystem\nTroubleshoot issues in and improve functionality of existing systems\nIntegrate user-facing elements developed by mobile and web teams. Work with 3rd party data sources and APIs (systems integration)\nEmbed security and data protection\nActively collaborate with a cross-functional team working with product owners, UI\/UX designers, backend s, app s and QA at various stages of the development process.\nDevelop appropriate tests to support code and ensure test automation and code quality and security\nConduct unit testing on your code and conduct code reviews.\nBased on the project needs and end goals, proactively suggest improvements to architecture and technologies to maximize development efficiency\nMentor and coach other backend s within the team\nYou will also be expected to keep your skills up to date by following advancements in the field and researching new and innovative technologies and techniques.\nCross functional\/interdisciplinary team with – Scrum Master, Product Owner, s, QA, UI\/UX specialist (if needed)\n\n\nWhat you will bring\nMinimum 5 years of software development experience, at least 3 of which are hands on Python coding\nSolid knowledge of Python web frameworks (Flask, Django, FastAPI or such)\nIn-depth knowledge of modern software design patterns\nAbility to design elegant and efficient JSON REST APIs for given use cases (using OpenAPI standard and toolchain)\nGood understanding of (and significant experience in) concurrent and parallel computing, asynchronicity, distributed computing patterns and principles\nSolid knowledge of common algorithms, data structures, OOP (patterns and specific python implementations)\nUnderstanding of CI\/CD development practice and tools, experience writing Integration and Unit tests in Python\nCombination of good coding skills, end to end thinking and problem solving approach and track record of standalone delivering bigger chunks of work\nGood knowledge of Agile principles and experience with some popular issue tracking tool (for example Jira)\nAbility to communicate effectively to a variety of audiences including both technical and non-technical stakeholders\n\n\nWhat we offer\nFully covered Social Insurance\nMedical Insurance\nLife Insurance\nCompetitive salaries\nProvide you with Laptop and set up\n10 days training \/ year\nReferral bonus, Birth Bonus and Marriage bonus\n","isSuitable":false},{"fullText":"About the job\nWe are seeking to hire \" Senior DevOps Engineer \" for one of our clients located in New Cairo.\n\n\n*Work Type: On-Site\n\n\n*Job Description:\n\n\n1. Analyzes the technology currently being used and develops plans and processes for improvement and expansion. The DevOps engineer provides support for urgent analytic needs.\n2. Develops, codes, builds, installs, configures, and maintains IT solutions.\n3. Participates in project planning meetings to share their knowledge of system options, risk, impact, and costs vs. benefits. In addition, DevOps engineers communicate operational requirements and development forecasts.\n4. Tests code, processes, and deployments to identify ways to streamline and minimize errors.\n5. Uses configuration management software to automatically deploy updates and fixes into the production environment.\n6. Perform routine application maintenance to ensure the production environment runs smoothly. Develops maintenance requirements and procedures.\n7. Recommends performance enhancements by performing gap analysis, identifying alternative solutions, and assisting with modifications.\n\n\nQualifications:\n\n\n• University Degree Holder Computer Science, Engineering, Software Engineering, or a relevant field.\n• For the DevOps Senior Engineer: above 4 years’ experience. \n\n• Experience in developing software applications and a good knowledge of scripting languages such as Java, Go, JavaScript, Python, NodeJS and so on.\n• Knowledge of Various DevOps Tools and Technologies such as Git, GitLab, Kubernetes, Docker, Prometheus, Grafana, Elastic Search and Kibana. \n\n• Experience with managing deployments and integrations \n\n• Experience in, an Agile software development environment.\n\n\nFor interested candidates, kindly send your updated CV to S.ashraf@infinitybs-eg.com and please mention the title in the subject.\n","isSuitable":false},{"fullText":"About the job\nSenior Node.js  is required to join MICIT Company \n\n\n\nBevatel Project: www.bevatel.com\n\n\nLocation: Dokki\n\n\nJob Description Brief:\n\n\nWe are seeking a highly skilled and experienced Senior Node.js  to join our dynamic team. The ideal candidate will have a minimum of 4 years of professional experience working with Node.js. As a Senior Node.js , you will play a key role in building robust and scalable applications, developing Restful APIs, and contributing to the success of our projects.\n\n\nJob Requirements:\n\n\n- 4+ years of professional experience working with Node.js.\n- Solid understanding of asynchronous programming and event-driven architecture.\n- Familiarity with version control systems, preferably Git.\n- Familiarity with agile development methodologies\n- Experience building Restful APIs using Node.js\n- Experience using ExpressJS or NestJS\n- Experience in both JavaScript and Typescript writing Node.js Applications.\n- Experience with REST, WebSocket, MySQL\/PostgreSQL, MongoDB, Redis;\n\n\nIf you are interested, kindly send your updated CV mentioning \" Senior Node.js \" in the subject to:\n\n\nRecruitment@bevatel.com or al.bashir@bevatel.com\n","isSuitable":false},{"fullText":"About the job\nWe are looking for Senior .NET  to EJADA team.\n\n\nQualifications\n\n\nA must-have experience: +4 years\nExcellent knowledge of Object-Oriented Programming (OOP) principles and design patterns\nExpertise in .NET Core framework and software development\nProficiency in programming languages such as C# and Javascript\nExperience in developing ASP.NET MVC, .NET core API)\nWork with MVC, Web services, REST with Web API , JavaScript, jQuery, AJAX\nWorking with Entity Framework.\nAdvanced with modern web technologies such as Bootstrap,\nSolving scalability problems and understanding how to optimize code\/APIs to handle an increase in users.\nStrong problem-solving skills and attention to detail\nStrong communication and teamwork skills\nProficiency in the database (MS SQL-Oracle)\nBachelor's in Computer Science or related field\nExperience with Agile development methodologies is a plus\nExperience with Angular is a plus\n\n\n","isSuitable":false},{"fullText":"About the job\nCompany Description\n \nwe suggest you enter details here\n\n Role Description\n \nARRAKEEM - Airport Systems is seeking an experienced Automation Engineer for a full-time hybrid position located in Cairo, Egypt, with flexibility for some remote work. The Automation Engineer will be responsible for designing, developing, and implementing automated systems and processes to optimize Airport Electro Mechanical Systems operations. They will work with cross-functional teams to identify business needs and opportunities and develop solutions to improve efficiencies and costs, while maintaining quality standards and compliance requirements.\n\n Qualifications\n \nBachelor's degree in Electrical Automation, or Industrial Engineering, or a related field\n3-5 years of relevant experience in automation design, development, and implementation\nExperience with automation tools and software such as PLC, HMI, SCADA, and Data Historians\nKnowledge of programming languages such as C++, Python, and Java\nExperience with project management tools such as MS Project, Trello, and Asana\nStrong analytical skills with the ability to identify issues and develop solutions\nExcellent written and verbal communication skills in English and Arabic\nExperience working in a team environment and ability to collaborate with cross-functional teams\nAbility to work independently and manage multiple projects and priorities with competing deadlines\nExperience working in airport systems, logistics, transportation, or other relevant industries.\n","isSuitable":false},{"fullText":"About the job\nJob Description:\nThe Quality Control Manager in the stone and marble industry assumes the critical responsibility of ensuring comprehensive quality assurance of products and processes. They oversee the development and implementation of quality assurance strategies, ensuring adherence of products to rigorous standards specific to the stone and marble industry. Additionally, the role involves managing the quality control team, guiding them to conduct necessary tests and analyses to provide accurate quality reports.\n\n\nResponsibilities:\n1. Develop and enhance procedures and processes to ensure continuous quality in the production of stone and marble.\n2. Direct the team to conduct tests and analyses necessary to ensure product compliance with specifications and industry standards.\n3. Monitor and evaluate process efficiency, identifying areas for improvement to ensure excellence in quality.\n4. Ensure compliance with technical standards and stringent regulations related to safety and quality in the stone and marble industry.\n5. Utilize data and analytics to improve processes and make strategic decisions for continuous development.\n6. Communicate and coordinate effectively with other departments within the organization, such as production and design, to ensure comprehensive alignment.\n\n\nSkills and Requirements:\n- Minimum of (5) years of experience in quality control management in the stone and marble industry or related field.\n- Profound knowledge of quality assurance methods and standards within the stone and marble industry.\n- Excellent leadership skills and the ability to guide the team toward achieving the highest quality standards.\n- Strong analytical skills and the ability to use data for strategic decision-making.\n- Exceptional communication and interaction abilities with various departments within the organization.\n","isSuitable":false},{"fullText":"About the job\nCompany Description\n\nEBE is a market leader in providing high quality services to sectors such as Banking and Retail. Our services are tailored to serve our customers at the highest levels of performance enabling them to achieve their highest business objectives. We are located in El Dokki and are committed to providing exceptional services to our clients.\n\n\nRole Description\n\nEBE is seeking an experienced C\/C++ Senior  for a full-time hybrid role with the flexibility , the Senior  will work on Linux POS development. The Senior  will be responsible for creating and maintaining software using C and C++. Additionally, the Senior  will work on problem-solving and debugging complex software systems.\n\n\nQualifications\n\nComputer Science degree or equivalent experience\nMinimum of 3 years of experience in software development\nStrong knowledge of C and C++ programming languages\nExperience in optimizing code and debugging complex software systems\nComfortable working independently and in a team environment\nExcellent problem-solving skills\nExperience with agile development methodologies\nExperience with version control systems such as Git\nBachelor's degree in Computer Science or related field is beneficial\n","isSuitable":false},{"fullText":"About the job\nSpiderSEO is looking for an SEO Project Manager to be responsible for our search engine optimization activities.\n\n\nQualifications:\n\nMinimum 2 years of experience successfully developing and executing SEO campaigns is a must.\nComfortable analyzing high volumes of data on a daily basis.\nExperience with other aspects of marketing, such as customer growth and promotion, is a plus.\n\n\nResponsibilities:\n\nResearch SEO keywords to use throughout the client's website and marketing materials\nWrite adequate metadata and on-page elements for webpages - tailored for the target audience\nConstantly check search terms, rankings, and analytics to monitor the performance of client websites and make recommendations for improvement\nDevelop and integrate content marketing strategies\nSet measurable goals that demonstrate improvement in marketing efforts\n\n\n","isSuitable":false},{"fullText":"About the job\nJob Purpose\n\n\n• Assists the Information Security in implementing Etisalat’s information security program and strategy to protect information assets.\n• Technically assess security demands, test Etisalat Misr applications, systems, and infrastructure against security requirements.\n\n\nJob Description\n\n\nExecute, implement, and develop the Information Security Program\nResearch and evaluate products and technologies to protect Etisalat's Information Security assets and capable of evaluating products\/technologies independently\nAssist in the evaluation of Security demands projects\nParticipate in B2B consulting services regarding compliance and security portfolio\nDevelop security training contents for IT and Technical department\nDevelop security standards for infrastructure and application security\nEvaluate and meet with application security Vendors\nPrepare and deliver application security Training to application s\nTest and reverse engineer mobile applications\nConduct digital forensics investigations across endpoints, network and mobile devices\nPerform malware analysis and sample reverse engineering\nResearch exploit mitigation techniques and tools\nPerform awareness session delivery and participate in the content creations\nAssisting in evaluating security technology proof of concepts engagements\nDeliver inductions sessions and participate in information security awareness program delivery\nSupport the Information Security and Risk Manager in implementing the Information Security Program.\nResearch and assist in the evaluation of products and technologies to protect Etisalat's Information Security Assets\nKeep abreast of the latest threats and practices to address security exposures and threats\nPerform penetration testing and auditing activities under the supervision of the Information Security and Risk Manager\nAssisting in the development and implementation of the information security awareness program\nProvide assistance in incident handling response and investigation.\nAssist in the performing of risk management activities when needed\nPerform application security related activities including integrating security throughout the application development lifecycle\nPerform other information security related duties as assigned (capable of working unsupervised)\nCustomer Centricity (Sales \/cc Staff) Creates a positive customer experience at the point of sale and post-sales journeys. (Non-sales) Creates a positive internal customer experience during internal customer journeys and touch points\nInnovation Continuously learn new trends in the market and propose new ideas, approaches and insights\nOperational Excellence Takes responsibility— Accepts responsibility for outcomes of one's work; with focus on accurate high quality operations daily routine, processes and workflows.\nPeople Management Demonstration of team spirit and a proactive collaboration with cross functional projects.\nDemonstrate company values and compliance with company policy.\n\n\n\n\nQualifications \n\n\n\n University Degree in Computer Science\/Engineering or Communications\n Very Good computer skills\n Fast learner and reader with the ability to understand diverse technologies\n Very Good in Arabic & English (Reading, Writing & Oral).\n Web Application Security Background\n Network Penetration Testing Experience\n Systems Penetration Testing Experience\n\n\n\n\nQUALIFICATIONS_DESIRABLE\n\n\n ISO 27001 and PCI compliance Background\n Reverse Engineering Skills\n Incident Handling Skills\n Presentation Skills\n Technical Writing Skills\n\n\n\n\nEXPERIENCE_ESSENTIAL\n\n\n 10+ years in (Network\/ Application\/ Systems) penetration testing or security assessment with 5+ year’s minimum experience in Security Engineering\/ Consultancy.\n Previous experience should be in one of the following areas: Network Security, Application Development, Information Security, System Administration, Mobile Penetration Experience, and Compliance Consultancy.\n","isSuitable":false},{"fullText":"About the job\nWe are looking for a Backend  to join our Cairo office at 6th October city to work with our team members to ensure high performance and responsiveness to frontend requests using his\/her experience with programming to analyze codes and industry developments, to formulate more efficient processes, to solve problems, and to create a more seamless experience for users.\n\n\nResponsibilities:\n\n\nCompile and analyze data, processes, and codes to troubleshoot problems and identify areas for improvement\nCollaborate with the frontend and other team members to establish objectives and design more functional, cohesive codes to enhance the user experience and to validate the business needs from a technical perspective\nDevelop ideas for new projects by monitoring industry developments and trends\nParticipate in continuing education and training to remain current on best practices, learn new programming languages, and assist other team members.\n\n\nQualifications:\n\n\nBachelor’s degree in Computer Science or related field\nProficiency with GoLang, SQL, NoSQL\nKnowledge of PHP and Laravel framework is a plus\nVery good knowledge of Microservices architecture and AWS\n2+ years of experience in backend development\nAbility to work independently or with a group\nExcellent problem-solving.\n\n\n","isSuitable":false},{"fullText":"About the job\nJob Description\n\nThis is a full-time on-site Sr. Infrastructure & Security Engineer role located in 6th of October. The Sr. Infrastructure & Security Engineer will be responsible for designing and implementing IT strategies to improve network performance and security. They will maintain the Ezz-Elarab Automotive Group's systems, troubleshoot issues, and ensure data security. They will also recommend hardware and software upgrades and train team members on new technology.\n\n\nQualifications\n\nPerform Administration and Deployment of UCM, Voice Gateways\/ Routers\/ Switches.\nMust have Fortinet solutions experience.\nMaintenance activities and provide Level 1 support for CUCM or Avaya UC systems.\nOversee the access points, IP telephony, PBX and other hardware set-ups.\nRespond to UCM and CC monitoring alerts to identify and take appropriate action to avoid service impact.\nUnderstand of voice protocols such as SIP, H323, MGCP, and SCCP.\nManage Office 365 administrations & Windows Servers Administrator.\nResponsible for all IT data center equipment hardware including UCM, CC, Voice Gateway, Call recorder, Servers, and SAN Storages.\nResponsible for the stability and reliability of the entire data center room in HQ.\nResponsible for call record backup and restore and ensure all data are backed up according to the Backup Policy.\nSupport IT network infrastructure in HQ and remote sites.\nCoordinate with IT teams for any new system implementation or upgrade.\nEnsure compliance with best practices, policies and procedures. \nCreate and maintain good technical documentation.\nDevelop, maintain, and monitor procedures for all voice network tasks.\nImplement security improvements by assessing the current situation and evaluating trends.\nDetermine security violations and deficiencies by conducting periodic audits.\nIdentify technologies to improve security, scalability, and reliability of the overall secured IT environment.\n\nRequirements:\n\nEducation: Computer Science or any relevant field.\nExperience: 5 - 7 Years.\n","isSuitable":false},{"fullText":"About the job\nJob Summary:\n\n\nWe are seeking a highly skilled Full Stack .NET  to join our team. The successful candidate will\n\n\nbe responsible for developing and maintaining web applications using the latest technologies. You will\n\n\nwork closely with our development team to ensur\ne that all projects are completed on time and to the\n\n\nhighest quality standards.\n\n\nResponsibilities:\n\n\n-\n \nDesign, develop, and maintain web applications using .NET technologies\n\n\n-\n \nCollaborate with cross\n-\nfunctional teams to identify business requirements and translate them into\n\n\ntechnical specifications\n\n\n-\n \nWrite clean, efficient, and well\n-\ndocumented code\n\n\n-\n \nDevelop and maintain database schemas, stored procedures, and queries\n\n\n-\n \nImplement security measures to protect data from unauthorized access\n\n\n-\n \nTroubleshoot issues and provide timely resolutions\n\n\n-\n \nStay up\n-\nto\n-\ndate with emerging trends in software development\n\n\nRequirements:\n\n\n-\n \nBachelor's degree in Computer Science or related field\n\n\n-\n \n2+ years of experience in full\n-\nstack .NET development\n\n\n-\n \nStrong knowledge of C#, ASP.NET MVC, Web API, HTML\/CSS\/JavaScript, SQL Server\n\n\n-\n \nExperience with front\n-\nend framework\n \nReactJS\n\n\n-\n \nFamiliarity with Agile methodologies and DevOps practices\n\n\n-\n \nExcellent problem\n-\nsolving skills and attention to detail\n\n\n-\n \nStrong communication skills\n","isSuitable":false},{"fullText":"About the job\nObjectives of this role\n\nBuilding and implementing new development tools and infrastructure\nUnderstanding the needs of stakeholders and conveying them to s\nWorking on ways to automate and improve development and release processes.\nTesting and examining code written by others and analyzing results.\nEnsuring that systems are safe and secure against cybersecurity threats.\nIdentifying technical problems and developing software updates and fixes.\nWorking with software s and software engineers to ensure that development follows established processes and works as intended.\nPlanning projects and being involved in project management decisions.\nResponsibilities\n\nDeploy updates and fixes and provide Level 2 technical support.\nBuild tools to reduce occurrence of errors and improve customer experience.\nDevelop software to integrate with internal back-end systems.\nPerform root cause analysis of production errors and resolve technical issues.\nDevelop scripts to automate visualization.\nDesign procedures for system troubleshooting and maintenance.\nAbility to provide estimation of effort for technical developments.\nAbility to manage stream deliverables.\nResponsible for issue resolution post go-live and transition to support.\nMaintain software and support life-cycle-management of microservices & Machine Learning components through CICD.\nProvides innovative solutions for high-quality products, optimization, problem fixing & automation and Support product & security documentation.\nRequired skills and qualifications.\n\nExperience as a DevOps engineer or in a similar software engineering role.\nProficiency with Git and GitHub workflows.\nGood knowledge of Ruby or Python.\nWorking knowledge of databases and SQL.\nProblem-solving attitude.\nCollaborative team spirit.\nHands-on with Jenkins, Ansible, Terraform, Linux.\nExperience in REST, Microservices, Dockers, Kubernetes, SQL, TDD, CICD and workflow management such as PREFECT\/ARGO, Jenkins, Ansible & GitLab-CI.\nExperience in Python programming, Agile software development methodologies & cloud computing platform.\nExperience with pub\/sub systems – eg. Kafka, RabbitMQ & ML DevOps.\n \nPreferred skills and qualifications\n\nBachelor of science degree (or equivalent) in computer science, engineering, or relevant field.\n7+ years of total experience and 3-5 years of working experience in a similar position\/area.\n \nAdditional Requirements\n\nExcellent problem-solving, trouble-shooting skills & Good communication skills and social ability.\nStrong capability for English communication, collaboration, and self-learning.\n","isSuitable":false},{"fullText":"About the job\nJob Overview:\n\nThe Technical Lead is responsible for leading his team and alignment of the technical direction. Providing a strong technical direction involves establishing a technical vision, resolving technical disagreements and managing the technical quality of team deliverables. He\/ She should ensures that the team uses appropriate engineering practices, invests in continual improvements to tooling or technical debt, and that the system evolves to meet its changing needs and environment.\nQualifications & Prerequisites:\n\n· Bachelor's degree in Computer Science (or related field).\n· Solid Principles and OOP Analysis & Design.\n· Collaborate with the team in software design; database architecture, business classes and business workflow models.\n· Solid understanding of the software development life-cycle.\n· Excellent troubleshooting and problem-solving skills\n· Capable in .Net core and Angular\n· Experience with Entity Framework and MS SQL.\n· Debug, Test, Deploy, and maintain applications.\n· Develop web services\/web API.\n· Familiar with design patterns.\n· IIS configurations and troubleshooting.\n· High communication and critical thinking skills.\n· Experience with Angular is a must.\nMain Duties:\n\n1. Grow, coach, hire and lead a development team.\n2. Research, design, implement innovative software solutions and deliver projects on-time and to specification with high level of quality.\n3. Work closely with the Scrum master to construct Sprints and plan tasks and estimates with the team.\n4. Investigate new technologies to be up to date with the new technical knowledge and skills.\n5. Review requirements, specifications and technical design documents to provide timely and meaningful feedback\n6. Ensure the performance, quality, and responsiveness of our products and components.\n7. Drive and lead software design, development standards, code reviews.\n8. Continually evaluate emerging technologies to identify opportunities, trends, and best practices that can be leveraged to strengthen the technology platform and develop practices.\n9. Supports and develops software engineers by providing advice, coaching and educational opportunities\n","isSuitable":false},{"fullText":"Duties:\n\nCollaborate with members of the development team. \nDesign and implement robust, resilient, secure and scalable web applications, both front-end and back-end.\nDesign and implement technological tools used to achieve our operational objectives in the management of our products at each stage of their life cycle, as well as to ensure their availability and security participate in the continuous improvement of our software development processes.\nGet involved and participate in every stage of the software lifecycle.\nParticipate in code reviews and ensure that all solutions are aligned to pre-defined architectural specifications. identify and troubleshoot application code-related issues.\n\n\nTechnical Requirements:\n\n3+ years of software development experience.\nExperience in design patterns and system architecture.\nSolid Knowledge in Microservices or Redis or CQRS.\nExperience in any .NET \/ C#, .NET Core.\nExperience in Vue.JS\/ React \/or Angular.\n","isSuitable":false},{"fullText":"About the job\nResponsibilities\n\nWork with development teams and product managers to ideate software solutions\nDevelop and manage well-functioning databases and applications\nWrite effective and secure APIs\nTest software to ensure responsiveness and efficiency\nTroubleshoot, debug, and upgrade software\nCreate security and data protection settings\nBuild features and applications with a mobile responsive design\nWrite technical documentation\nTranslate the functional and technical requirements and specifications into application components.\nBuild and Maintain application components using .NET Core, ASP.NET, C#, Entity Framework\nDevelop and write high-quality coding standards.\nImplement best practices, standards, and procedures including quality and delivery methodologies.\n\n\nQualifications\n\n● A bachelor's or master’s degree\n● 5 years of experience in software development .Net Stack\n● Solid Experience with Rabbit MQ and Docker\n\n● Solid OOP concepts, best practices, SOLID principles, and enterprise integration\n● Good Experience with Testing Frameworks ( XUnit ) to build Unit Test and Integration Test\n● Familiar with Agile Methodologies\n","isSuitable":false},{"fullText":"About the job\nSnowHeap LLC, a leading data analytics and artificial intelligence company based in Sharjah Media City, United Arab Emirates, is seeking a Full-stack Software Engineer (AI Applications) to join their team. With over a decade of experience, we specialize in developing innovative platforms and solutions to cater for our clients’ problems and create practical and easy-to-use solutions. The company operates within the Software Development industry and has a strong team of dedicated employees. This is an exciting opportunity to work with cutting-edge technologies and make a significant impact in the field of AI.\n\nTasks\n\nDesign and develop full-stack applications using artificial intelligence technologies\nCollaborate with cross-functional teams to gather requirements and implement innovative solutions\nWrite clean, efficient, and maintainable code for both front-end and back-end components\nIntegrate AI models and algorithms into the software system to enhance functionality and performance\nConduct thorough testing and debugging of the applications to ensure high quality and reliability\nFollowing an internal software development process.\nPerforming analysis on requirements to identify potential gaps & dependencies, determine feasibility and time\/effort required for designing, implementing, and testing individual components.\nWriting detailed technical requirements.\nWriting technical design documents with UML diagrams.\nImplementing technical designs either solo or in a team.\nWriting good unit, integration and e2e tests.\nAttending internal calls, design meetings and discussions.\nCommunicating progress on a daily through meetings, chat and task board.\nHandling direct client communication.\nMonitoring issues that are reported by our clients.\nProviding technical support to clients when requested.\n\n\nRequirements\n\n4 years of experience at minimum.\nJavaScript and\/or TypeScript.\nReactJS and\/or NextJS frameworks for front-end.\nTailwind CSS or similar libraries for UI design implementation\nNodeJS, NestJS and\/or .NET Core for back-end.\nSQL Databases (e.g., BigQuery, SQL Server)\nDocker\nGit & Version Control\nSystem architecture\nClean Architecture\nDomain Driven Design\nAcceptance Testing\n\n\nAI-Specific Requirements\n\nFastAPI\nLLM Foundational concepts\nLangchain Python (LCEL & Agent chains with tools)\nLlamaindex\nRetrieval Augmented Generation (RAG)\nVector stores\n\n\nOur ideal candidate is an engineer who can demonstrate:\n\nGreat communication skills.\nGreat problem-solving skills.\nWorking as part of a team, or leadership skills.\nAbility to write and speak English clearly.\nQuick learning and high adaptability.\nWriting high-quality code and delivering high-quality solutions.\nDesigning & architecting software according to requirements.\nExperience with databases and writing efficient queries.\nGood handle of client communication.\n\n\nMinimum Qualifications\n\nA bachelor’s degree in Information Technology, Computer Science, Software Engineering, Computer Engineering or other relevant disciplines.\n","isSuitable":false},{"fullText":"About the job\nWe are looking for an outstanding WordPress  to be responsible for the coding, innovative design, and layout of our client's website. WordPress  responsibilities include building our website from concept all the way to completion from the bottom up, fashioning everything from the home page to site layout and function.\n\n\nResponsibilities:\n\n\n\nHaving a good eye for design to ensure visually appealing and user-friendly website layouts.\nWrite well-designed, testable, efficient code by using best software development practices.\nHaving a good eye for design to ensure visually appealing and user-friendly website layouts.\nCreating\/modifying WordPress plugins in PHP to enhance website functionality and meet client needs.\nConducting back-end web development tasks, database management, and integration of third-party APIs.\nPerforming front-end development tasks such as HTML, CSS, and JavaScript coding to implement responsive web design and ensure cross-browser compatibility.\nCollaborating with the design team to optimize website performance, navigation, and overall user experience.\nTroubleshooting and resolving any technical issues that arise during the website development process.\nStaying up-to-date with the latest web development trends, technologies, and best practices.\nWorking independently and remotely while delivering high-quality work within deadlines.\nDemonstrating excellent communication and problem-solving skills within a team environment.\n\n\nWhat You Will Bring:\n\n\n\nDeep knowledge and at least 4 years of experience with WordPress backend and frontend development\nSolid expertise in CSS3 \/ SCSS, HTML5, JavaScript and PHP\nExperience with front-end tooling for JS and CSS\nYou are enthusiastic about web development and open-source technologies\nYou can write and speak English at a good level\nFlexibility and an independent and structured way of working\nProfessional in using custom fields, CPTs, filtering (FacetWP), Elementor ( custom templates for post types like custom product single page ), WPML, and more.\nYou are self-motivated and organized, with good online communication in a remote environment\nAnalytical skills and a creative and solution-oriented way of thinking and working\nYou write clean and performant code that is solidly commented \/ documented\nExperience working with REST API \/ GraphQL\nGood understanding of databases and SQL\nExperience with WooCommerce, WordPress Multisite, API integrations\n\n\nBenefits:\n\n\n\n8 hrs \/ 5 days\nFully remote\nFlexible working hours\n","isSuitable":false},{"fullText":"About the job\nWhen you think of food delivery in the MENA region, we’d be pretty surprised if talabat didn’t pop into your mind first! Since delivering our first order in Kuwait in 2004, we’ve grown quite a lot over the past 17 years.\n\nToday, we deliver hundreds of millions of food orders, grocery items and other products per year, to our customers in nine countries throughout the region with more than 3,000+ employees! Our food delivery business works with over 27,000 brands and almost 50,000 branches, while our q-commerce concept, talabat mart, now delivers groceries to customers in Bahrain, Egypt, Jordan, Kuwait, Oman Qatar, and the UAE in 30 minutes or less!\n\nOur philosophy is to make sure we do what is right for our ecosystem - our customers, our partners, our people, our riders, and the communities in which we operate. Our #techforgood program allows our customers a safe and convenient way to contribute to important causes in their community through donating to local and international charities directly on talabat with a focus on food insecurity in the region. Since its inception in 2020, we have facilitated the donation of well over 1 million meals to those in need, as well as donated over $1.5 million to charity with the help of our partners and customers. talabat is part of Delivery Hero, the global leader in online food delivery and q-commerce.\n\nWe love finding new ways to shorten the feedback loops, create together and make an impact. To do so, our engineering culture and practices are based on eXtreme Programming (XP), Domain-Driven Design, Lean and Continuous Delivery\n\nWe believe that the assumption behind the “Speed vs Quality” mindset is flawed and that you can both have your cake and eat it too. For us, quality enables speed. Not in 2 years, but now.\n\nCo-creating together with others through Pair and Mob programming helps us deliver more value sooner and find joy in our work by seeking productive human connections with others.\n\nWe find that engineers seeking to understand our product and business better understand the context of their work, which helps them to innovate, deliver more value to their customers and find more purpose in their work\n\nRole Summary\n\nAlongside your cross-functional team (engineering, product, data), participate in continuous discovery of your customer\/business needs\/desires\/problems to drive desired outcomes\nDesign, write and release software as a solution to an end-to-end problem in your business domain and deliver value in small batches in accordance with our engineering standards.\nUnderstand scalability & complexity of your services and own & innovate the entire SDLC\nMentor and inspire other engineers and continually optimize your team’s practices to develop it into a self-organized, continuously improving unit\nCritically question and simplify our tech org systems\/processes and solutions.\n\n\nNote\n\nOn top of very good technical skills, this role requires someone willing to assume end-to-end ownership of a specific area\/initiative and thrives on emphasizing with their user pains\/desires\/needs. You are keen to explore alternative ways of working that optimize for co-creation and continuous improvement.\n\nThe Following Experience Is Relevant To Us\n\nEmpathetic and able to easily build relationships \nGood verbal and written communication skills\nHumble, curious, and open-minded with a growth mindset, thriving on continuous feedback\nUnderstanding of lean\/agile values & principles and associated practices\nAbility to mentor other engineers \n5+ years of software engineering experience, preferably within Extreme Programming environment (TDD, Pair Programming, Simple Design, and Continuous Refactoring) \nProficient in testing with focus on automated end to end quality\nExperience in Distributed Systems Architecture (Microservices, Event-Driven, and RESTful Services)\nExperience working with relational and nonrelational databases\nExposed to cloud platforms (e.g. AWS, Google Cloud, Azure)\nExperience building, maintaining and improving with Trunk Based Development and Continuous Delivery.\n\n\nBenefits\n\nWorking within talabat means access to perks and benefits that are adjusted to your circumstances - i.e. whether you like to work remotely or in the office.\n\n Dynamic & innovative environment where you’re not constrained by the boundaries of your role \nBuilding the fastest growing, largest, and most valuable network of online food ordering services in the world \nWorking with diverse, cross-cultural teams from over 50+ nationalities \nCompany events, hackathons, cultural and sports events \nComprehensive healthcare \nRelocation package \/ WFH setup package \nCompetitive remuneration\n","isSuitable":false},{"fullText":"About the job\nPosition:\n\nSolution Architect\n\nJob Description:\n\nThe Software Architect is responsible for the technical design and implementation of software solutions, as well as providing technical leadership to multiple software development teams.\n\nResponsibilities\n\n\nEnsuring products meet our architectural standards about security, privacy, performance, and scalability.\nDesign, develop, and execute software solutions to address business requirements\nProvide architectural blueprints for development teams\nRemain plugged into enterprise architecture and security groups to ensure our solutions remain compliant with emerging standards\nLooking for problems within software systems and resolving the issues\n\nSkills\n\n\nA thorough understanding of Object-Oriented analysis and design and enterprise architecture patterns\nFluent with Java and related technologies, Nodejs and Angular is a plus\nExperience with Designing, Developing, and Maintaining Hosting Infrastructure (Cloud and Traditional)\nExperience with Microservices, Micro frontend is a plus\nExperience with multiple database management systems, including MySQL, Oracle, MongoDB, Microsoft SQL Server, and Cloud Databases\n10+ years of technical leadership and architecture experience\nProven ability to think strategically,and innovatively, and develop tactical execution plans to drive success\nAbility to work with legal, risk, compliance, marketing, IT, and other cross-functional teams to deliver strategic and tactical plans\nProven ability to analyze and evaluate technologies and vendors to drive strategic and tactical recommendations\nExcellent written and verbal communication with strong presence; able to develop presentations\/communications that achieve maximum impact and influence\nAbility to navigate at all levels in the organization and interact effectively and confidently with audiences of varying skill sets and authority.\nProven strong leader that positively motivates others and successfully builds relationships.\nCollaborative, able to bring teams together and direct work to achieve goals\nAbility to manage issue resolution - including the identification of issues, developing a resolution plan, and executing the changes needed\nMaintain professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; participating in professional societies.\n\nLocation:\n\nEG-Cairo, Egypt (Al Emdad & Al Tamween)\n\nTime Type:\n\nFull time\n\nJob Category:\n\nInformation Technology\n","isSuitable":false},{"fullText":"About the job\nJob Description\n\nAs a Senior Software Architect, your role is pivotal in designing and overseeing the development of software systems and applications that meet the functionality, performance, scalability, and maintainability goals for our clients company.\n\n\nKey Responsibilities\n\nDefine and create the overall software architecture for .NET-based applications, ensuring scalability, reliability, and maintainability.\nEnsure seamless data flow and interoperability across various components of the software architecture.\nIdentify and address performance bottlenecks in the software architecture, selecting appropriate technologies, frameworks, and tools for implementation.\nEnsure that architectural principles, standards, and guidelines are followed throughout the development lifecycle.\nProvide guidance to development teams on software design patterns, best practices, and coding standards from an architectural perspective.\nEnsure compliance with security requirements and industry regulations with the Architecture team.\nParticipate in the estimation and planning of software development projects.\n\n\nQualifications\n\n8+ years of professional experience in software design\/development.\nA minimum of 3 years of experience in a similar role.\nProven experience as a .NET , with a deep understanding of the .NET framework, C#, and related technologies.\nSolid knowledge of software architecture principles and design patterns.\nExperience designing and implementing scalable and secure software systems using .NET.\nBachelor's or degree in Computer Science, Software Engineering, or a related field.\nProficiency in software development methodologies, such as Agile or Scrum.\nStrong problem-solving and analytical skills.\nExcellent communication and collaboration abilities.\nAbility to work effectively in a team environment.\nRelevant certifications (e.g., Microsoft Certified: Azure  Associate, Microsoft Certified: Azure Solutions Architect Expert) are a plus.\n","isSuitable":false},{"fullText":"About the job\nJob Description:\n\nPerform programming tasks & unit testing according to the project plan and functional specifications.\nHandle the development of the project’s most complex and risky tasks.\nConduct technical research to gain technical knowledge and resolve technical difficulties. \nAnalyze & design new functional requirements and systems.\nParticipate in the estimation of new features and components.\nHandle product or application definition activities including feature analysis & system tradeoff\n\n\nJob Requirements:\n\nBachelor's degree in computer science, Information Technology, or equivalent.\n3+ years of experience using .NET technology\nProven experience implementing tasks using C#, ASP.NET CORE, ADO.NET, LINQ & Entity Framework.\nDemonstrable experience with Restful APIs & clean reusable code. - Proven Experience with MS SQL Server.\nStrong Experience with Git.\nKnowledge in HTML5, CSS3, JavaScript, JQuery, AJAX, Knockout JS, Angular, and JQuery is a plus.\nExperience with Distributed architectures, MicroServices, and Queuing Systems is a plus.\nExperience with unit, integration and functional testing is a plus\n","isSuitable":false},{"fullText":"About the job\nWe are looking to recruit an Senior Mobile Engineer with previous experience in Native Android and Native iOS development to join our team. You will be part of a multinational team and work alongside a pool of talented engineers, delivering excellent applications timely, pushing the boundaries of innovation in mobile, and reimagining it.\n\n\nYour responsibilities would include:\nUnderstanding the project needs and work on achieving all assigned tasks in a clear and timely manner.\nDesigning and building advanced applications for the Android and iOS platforms.\nTeaming up with cross-functional teams to define, design, and ship new features.\nWorking with outside data sources and APIs.\nUnit-test code for robustness, including edge cases, usability, and general reliability.\nWorking on bug fixing and improving application performance.\nContinuously discovering, evaluating, and implementing new technologies to maximize development efficiency.\nWriting reusable, testable, and efficient code.\nUnderstanding client requirements and translate them into functional applications.\nStaying curious and up to date with the latest industry trends in mobile technology.\n\n\nRequirements:\nComputer Science or Computer Engineering degree.\n7+ years of experience in native technology, both Android and iOS.\nXamarin is a plus \nC# is a plus\nGood understanding of the full mobile development life cycle.\nProven work experience in software development.\nDelivery oriented and multi-tasking person.\nExcellent analysis, technical design, development and problem-solving skills\nGood understanding of OOP and design patterns.\nExcellent verbal and written English communication skills (Native Level Required). \nExperience in the Agile software development process\n","isSuitable":false},{"fullText":"Role Overview: As a Senior AI Engineer, you will spearhead advanced initiatives in AI technology, focusing on Retrieval Augmented Generation (RAG), Large Language Models (LLMs), and innovative application development. Your role involves leading technical teams, driving research, and maintaining best practices in AI development, particularly in Python programming, NLP, and CI\/CD processes.\n\n\nKey Responsibilities:\n\n\n\nAdvanced AI System Development: Lead the development of sophisticated Retrieval Augmented Generation (RAG) techniques, focusing on enhancing the AI's ability to leverage external information sources for improved language generation tasks.\nExpertise in Large Language Models (LLMs): expert knowledge in the construction, optimization, and fine-tuning of LLMs, ensuring their effectiveness in various applications.\nPython Application Development: Design and develop robust AI applications in Python. This includes writing clean, efficient, and scalable code, and integrating AI models into broader application architectures.\nCode Review and Quality Assurance: Conduct detailed code reviews, enforce coding standards, and implement best practices to ensure high-quality software development.\nCI\/CD Processes: Set up and maintain Continuous Integration and Continuous Deployment pipelines, ensuring that AI applications are deployed efficiently with minimal downtime.\nNLP and Knowledge Mining: Apply advanced techniques in Natural Language Processing and knowledge mining to extract and utilize valuable insights from large datasets, enhancing the AI's understanding and contextual capabilities.\nLeadership and Team Management: Lead and mentor a team of AI engineers and s, fostering a collaborative environment and encouraging continuous learning and innovation.\nResearch and Development: Stay abreast of the latest trends and advancements in AI and machine learning. Initiate and lead research projects to explore new technologies and methodologies that could benefit the company's AI initiatives.\n\n\nQualifications:\n\nExperience: A minimum of 10 years of experience in the field of technology, with at least 7 of those years specifically focused on AI and machine learning, with a demonstrated focus on RAG, LLMs, and Python development in a professional setting.\nEducational Background: An advanced degree (Ph.D. preferred) in Computer Science, Artificial Intelligence, Machine Learning, or a closely related field.\nTechnical Expertise:\nProfound understanding and hands-on experience in developing and optimizing large language models.\nProven ability in building and maintaining Python-based applications, with a strong grasp of software development best practices.\nExperience in implementing and managing CI\/CD pipelines.\nDeep knowledge of NLP techniques and knowledge mining methodologies.\nLeadership Skills: Demonstrated experience in leading technical teams, with a track record of mentoring engineers and driving successful projects.\nCommunication and Collaboration: Excellent communication skills, with the ability to effectively articulate complex technical concepts to both technical and non-technical stakeholders. Strong collaboration skills to work effectively across different teams and disciplines.\n","isSuitable":false},{"fullText":"About the job\nCompany Description\n\nasgatech is an enterprise mobility solutions and products provider in the MENA region. With a physical presence of 19 years and 500 years of collective experience, our skilled s, designers, and technical architects are experienced across major manufacturers' platforms.\n\n\nRole Description\n\nThis is a full-time hybrid role for a Lead .NET  at asgatech. The Lead .NET  will be responsible for managing a team of s, designing and developing high-quality software solutions, and ensuring the timely completion of development projects. The role is located in Cairo, with flexibility for some remote work available.\n\n\nQualifications\n\n years experience at least in .NET development\nStrong knowledge of Object-Oriented Programming (OOP) concepts and Software Development principles\nExperience with .NET Core, ASP.NET MVC, and Programming\nAbility to write clean, efficient, and high-quality code\nExperience leading a team of s and managing projects\nExperience with Azure DevOps, Git, and Continuous Integration\/Continuous Deployment (CI\/CD) pipelines\nExcellent communication and problem-solving skills\nBachelor's degree in Computer Science, IT, or related field\nExperience with Agile\/Scrum methodologies is a plus\nExperience with mobile app development is a plus\n","isSuitable":false},{"fullText":"About the job\nCompany Description\n\nTidal is a software company that provides business-integrated software solutions. Our goal is to enhance a company's ability to generate reports on a timely, accurate, and comprehensive basis. We are committed to delivering high-quality software solutions that meet our client's needs.\nRole Description\n\nThis is a full-time on-site role for a  Senior .NET  located in Cairo. The role involves designing, developing, and maintaining software applications using Object-Oriented Programming (OOP) principles and the .NET Core framework. The Senior .NET  will also be responsible for programming, developing ASP.NET MVC applications.\nQualifications\n\nExcellent knowledge of Object-Oriented Programming (OOP) principles and design patterns\nExpertise in .NET Core framework and software development\nProficiency in programming languages such as C# and Javascript\nExperience in developing ASP.NET MVC, T-SQLWeb API)\nWork with OO programming, MVC, Web services, REST with Web API or WCF, JavaScript, jQuery, AJAX\nWorking with DevExpress and Entity Framework.\nAdvanced with modern web technologies such as Bootstrap,\nSolving scalability problems and understanding how to optimize code\/APIs to handle an increase in users.\nAbility to handle multiple tasks under tight deadlines\nStrong problem-solving skills and attention to detail\nStrong communication and teamwork skills\nProficiency in the database (MS SQL-MongoDB)\nBachelor's or Master's degree in Computer Science or related field\nExperience with Agile development methodologies is a plus\nExperience in the software development lifecycle is a plus\nHandle web-based systems\na must-have experience: +5 years\n","isSuitable":false},{"fullText":"About the job\nRoles & Responsibilities\nBuild high-quality reusable code.\nCoordinate and participate in all phases of the software development lifecycle to translate business requirements into functional code.\nTroubleshoot and debug applications.\nConduct tests and optimize performance.\nWrite technical documentation.\n\n\nAcademic\/Professional Qualification:\nBachelor degree in Computer Science or relevant discipline.\nExperience in designing and building applications in .NET.\n Cloud platform experience using Microsoft Azure.\nStrong knowledge of data structures, algorithms, object-oriented programming and design patterns.\nKnowledge of relational and NoSQL database management systems.\nHands-on experience developing\/integrating REST APIs.\nExperience working with distributed version control system (i.e., Git).\nExperience developing large scale software based on microservices architecture.\nFamiliar with DevOps culture and tools, building and configuring CI\/CD pipelines.\n\n\n\n\nProfessional Experience:\n4-6 years of professional work experience.\n","isSuitable":false},{"fullText":"About the job\nSenior Software  - London - £100,000 - £150,000\n C#, .NET, WPF, SQL \n\nSenior Software s required for an excellent client who are in the sports trading industry based in the City of London. The successful Software  will join a small but extremely talented development team and will be given the opportunity to work with the some of the latest technologies possible. As a Senior Software  you will be expected to produce excellent code for our clients in house software applications and will also be expected to offer advice and training to more junior members of the team when required. Many of the projects are greenfield projects and you'll be given the opportunity to make your own mark on them from the start. Our client offer a very collaborative working environment with the majority of the development team coming from excellent computer science and programming educational backgrounds from Russell Group universities. As well as offering extremely competitive salaries, our client offers a comprehensive benefits package and flexible working arrangements.\n  \n Skills required:\n\nC#\nWorked with the latest version of the .NET platform\nWPF\nSQL Server\nAzure\nExcellent communication skills both written and verbal\nHigh level aptitude for technology\nEducation to at least a BSc level or higher in Computer Science from a Russell Group University\n \n Desirable skills:\n\nHTML5, CSS, JavaScript\nMulti-threaded application development\nUnderstanding of Windows technologies\nNetwork Programming experience\n \n If you feel you have the skills and experience required for this opportunity, please contact Oliver Wilson on 02380 765 287 or email OliverWilson@SpectrumIT.co.uk\n Senior Software \n\nSpectrum IT Recruitment (South) Limited is acting as an Employment Agency in relation to this vacancy.\n","isSuitable":false},{"fullText":"About the job\nBlock Gemini is hiring in our office in Egypt.\nPosition Title: React Native \nLocation: Gameat El Dewal-El, Mohandseen, Cairo \n\nMinimum Experience: 4 Years\n\n\nWe are seeking to hire a React Native  interested in building performant mobile apps on both the iOS and Android platforms. You will be responsible for architecting and building these applications, as well as coordinating with the teams responsible for other layers of the product infrastructure. \n\n\n\nJob Requirements: \n\n\n\nBuild pixel-perfect, buttery smooth UIs across both mobile platforms. \n\nLeverage native APIs for deep integrations with both platforms.\nDiagnose and fix bugs and performance bottlenecks for performance that feels native. \n\nReach out to the open source community to encourage and help implement mission-critical software fixes—React Native moves fast and often breaks things. \n\nMaintain code and write automated tests to ensure the product is of the highest quality. \n\nTransition existing React web apps to React Native.\n\n\nKnowledge and Experience: \n\n\n\nFirm grasp of the JavaScript, Node.js language and its nuances.\nKnowledge of {{functional or object-oriented}} programming.\nAbility to write well-documented, clean Javascript code.\nRock solid at working with third-party dependencies and debugging dependency conflicts.\nFamiliarity with native build tools, like XCode, Gradle {{Android Studio, IntelliJ}}.\nUnderstanding of REST APIs, the document request model, and offline storage\nExperience in integrating Core Android\/IOS modules with React Native.\nEnglish fluency is a MUST.\n","isSuitable":false},{"fullText":"About the job\nThe Opportunity:\nAt the vanguard of APCO’s digital transformation, we are seeking a Senior Full Stack  to redefine our technological trajectory. Your expertise will be pivotal in harnessing generative AI technologies to create intelligent automations, shaping innovative products that serve both our internal teams and our expansive clientele. This is a clarion call for a visionary coder, a trailblazer who is ready to lead and inspire.\n\n\nYour Impact:\nInnovative Collaboration: Work across departments to uncover opportunities for impactful software development and automation.\nAI-Powered Solutions: Take the helm in designing and launching AI-driven platforms that redefine how we operate and deliver value.\nEnd-to-End Development: Craft web applications that are as scalable as they are maintainable, guiding them from ideation to live deployment.\nCross-Project Synergies: Strategically deploy insights, datasets, code, and models to amplify the efficacy of our projects.\nResearch and Prototyping: Spearhead the development of prototypes and proofs of concept alongside our AI specialists.\nEngineering Excellence: Adhere to rigorous software development processes, embedding best practices throughout the lifecycle.\nAnalytical Rigor: Analyze requirements, forecast challenges, dependencies, and devise thorough plans for component design and implementation.\nTechnical Documentation: Create comprehensive technical requirements and product documentation for all developed solutions.\nQuality Assurance: Commit to quality through robust unit, integration, and end-to-end testing.\nContinuous Learning: Stay ahead of trends in AI and full-stack development to ensure our technological edge.\nMentorship: Cultivate the technical acumen of junior s, guiding them towards expertise.\nLeadership: Provide strategic direction to the software development team, ensuring high standards of coding and best practices.\n\n\nQualifications & Experience:\nSenior-Level Experience: 4+ years in full-stack development roles.\nPython Proficiency: Skilled in Python and its prevalent libraries such as FastAPI and Pandas\/Modin.\nFront-End Expertise: Advanced knowledge of React (NextJS 13), Route Handlers, and Server Components for front-end development.\nArchitectural Understanding: Grasp of web development principles, serverless architectures, and system design.\nTechnical Breadth: Demonstrable expertise in at least 8 of the following areas:\no TypeScript or advanced JavaScript\no Data visualization using charting libraries like D3, AmCharts, or HighCharts\no DevOps practices, including Git, CI\/CD, containerization, and deployment\no API integration with REST, GraphQL, or tRPC\no WebSockets for real-time event communication between services.\no Proficiency with SQL and NoSQL databases, such as PostgresDB or CosmosDB\nError Handling Expertise: Demonstrated ability to create sophisticated error handling mechanisms within code, adept at identifying, logging, and resolving runtime errors, and adept at using debugging tools and techniques to troubleshoot complex issues.\nData Validation Expertise: Proficient in implementing data validation using Pydantic models in Python to ensure robust type checking and data integrity. Similarly, capable of defining typed interfaces with TypeScript to maintain consistency and prevent runtime errors in the application.\n\n\nPreferred Qualifications:\nUser-Centric Communication: Ability to articulate product value and operation to non-technical stakeholders.\nDesign Tools Acumen: Proficiency in Figma and exporting Figma components to React.\nAdvanced Tooling: Experience with advanced analytics platforms like Cube.js.\nCreative Flair: Familiarity with CSS and web animations for engaging user interfaces.\n\n\nEducational Background:\nDegree Requirement: Bachelor’s degree in Computer Science, Computer Engineering, or related fields, with a preference for candidates versed in digital communications.\n\n\nLanguage Proficiency:\nEnglish: Must be fluent.\nArabic: Fluency is a strong advantage.\n","isSuitable":false},{"fullText":"About the job\nResponsibilities:\nCollaborate with other engineers, product managers, and designers to solve challenging problems for delivering solutions that meet the business goals and requirements.\nDesign, build and maintain high performance, reusable, and reliable code using any modern language such as Nodejs, Java, or PHP.\nLeading architectural and design decisions in the migration of legacy applications. \nCoaching and mentoring other team members as senior members of the team.\nConducting code reviews and ensuring high code quality.\nWriting unit tests to ensure the quality of the developed features.\n\n\nRequirements:\n6+ years of Experience in Software Development.\nExcellent knowledge of relational databases and SQL.\nKnowledge of different datastores.\nExcellent knowledge of the best practices in developing RESTful APIs.\nExperience with message queueing services.\nExperience with CI\/CD systems such as Jenkins.\nExperience in Agile framework and Scrum methodologies.\nKnowledge and experience in NodeJS, or PHP is a plus.\nExperience in building and maintaining microservices is a plus.\n \n Who are we?\nAt Breadfast, we thrive to provide our customers with their everyday essentials and beyond through a consistent, customer-centric, and high-quality shopping experience.\n\n\nBreadfast is going big! We are domestically and regionally expanding across Egypt, the Middle East and Africa, aspiring to become the best friend of every household in the MEA region. And now we’re building a team of motivated and highly-skilled people that share our vision to help us drive it forward.\n","isSuitable":false},{"fullText":"About the job\nEstablished in 2008, Geidea epitomises customer focused empowerment and commercial success through continuous innovation\n\nGeidea makes best in class digital payment solutions available for all by attracting and leveraging the best creative & entrepreneurial talent in the market\n\nOur solutions give any business the chance to get ahead and reach for more no matter their size or maturity.\n\nOur technology mirrors our people - Smart, Innovative & Forward Thinking\n\nwww.geidea.net\n\nTo maintain competitive advantage as we grow, we are currently looking for new Frontend .\n\nKey Accountabilities:\n\n*Design, code, analyze, and test systems for android applications.\n* Develop applications for time-sensitive projects while considering business\/system requirements.\n* Identify and correct bottlenecks and fix bugs.\n* Help maintain code quality, organization, and\nautomatization.\n* Continuously discover, evaluate, and implement new technologies to maximize development efficiency.\n* Applications need to be developed with good design for the user interface.\n* Keep good track of assigned tasks and finish on deadlines.\n* Should be a good team player and lead project alone.\n\n\nRequired Education\n\nBachelor’s Degree in Computer Science, Computer Engineering, Information Technology, or a related field (or equivalent)\n\n\nRequired Work Experience\n\n*Experience: 3-5 years of Experience in Angular TS\n*Strong proficiency in Kotlin programming language.\n* Strong object-oriented programming and design skills.\n* Experience or knowledge of Kotlin Multi-platform Mobile (KMM) framework.\n* Awareness of Architectural Design Patterns: MVVM, Clean Architecture.\n* Strong knowledge of Android app components.\nSolid understanding of the full mobile development life cycle.\n* Understanding of Google’s design principles and interface guidelines.\n* Experience with RESTful services and JSON\/XML.\n* Continuous integration practices: Git, Azure DevOps, SonarQube, Unit testing, or other tools.\n* Experience with development in third-party libraries, and APIs.\n* Solid knowledge of different Android frameworks (Retrofit, Coroutines, Kotlin Flow, Dagger Hilt, Junit, Jetpack components, Firebase SDKs, etc.).\n* Should have knowledge of Proguard and Gradle build systems.\n* Knowledge of DevOps will be an added advantage.\n* Must have experience with TCP\/IP Socket programming.\n* Experience in the Fintech domain will be preferred.\n* Knowledge of SSL and HTTPS communication protocols.\n* Knowledge of encryption and decryption for secure communication.\n\n\nRequired Skills\/Competency\n\nTime management\nProblem-solving\ncommunication\nCollaboration\n\n\nRequired Computerized Skills\n\nCommercial experience with Angular TS, HTML and Javascript\nWorking with Microservices based architecture.\nKnows the most common design patterns, why and where to use them\nOOP mind, SOLID principles, code quality oriented\nConsuming Rest APIs\nunit testing, SOLID, clean code\n\n\nRequired Language Skills\n\nEnglish – Upper Intermediate\n\nCommand of Arabic language\n","isSuitable":false},{"fullText":"About the job\nAbout Minapharm:\n\nMinapharm Pharmaceuticals is a leading pharmaceutical company in Egypt and the Middle East and the largest end-to-end manufacturer of biological therapies in MEA with over 20 years of experience in cellular and bioprocess engineering. Headquartered in Cairo, Minapharm commercializes over 100 life-saving and life-enhancing products ranging from small molecules to complex bioengineered proteins and viral vectors, with an impressive immunotherapy pipeline. Together with its wholly-owned Berlin-based subsidiary, ProBioGen AG - a world-leading CDMO, Minapharm has established an integrated business model making it the only gene-to-market company in the region. Consolidating its international platform of intelligent biopharmaceutical technologies with the longstanding process development and manufacturing expertise in the MEA, Minapharm, together with ProBioGen, has incorporated MiGenTra GmbH headquartered in Berlin and manufacturing in Cairo, to enhance the accessibility to critical healthcare transforming medicines through product development and commercialization of Biosimilar mABs, Cell, and Gene Therapies and vaccines, at affordable prices in Egypt, and MEA.\n\n\nOur Values:\n\nDiversity & Respect\nIntegrity & Accountability\nCollaboration\nLeadership & Empowerment\nInnovation & Continuous Learning\n\n\nRoles and Responsibilities:\n\nCollaborate daily with the mobile development team, developing high quality, testable and performant Android & IOS applications using agile practices.\nDeveloping user interface components and implementing them by following well known \n Flutter \/ Dart workflows and practices.\nRobust integration with backend systems and 3rd party APIs.\nParticipate in documentation, debugging, implementation and maintenance of business applications.\n\n\nQualifications:\n\n Bachelor’s degree in Engineering, Computer science or Information technology.\n3+years of experience with cross platform flutter application development.\n\n\nEssential Knowledge and Skills:\n\nExperience with native IOS development is a huge plus\nStrong hands-on experience with Dart\nFull awareness of Android & IOS platform natures and restrictions\nUp to date with latest version releases of mobile OS.\nSolid understanding of common mobile application design patterns, and architecture patterns\nExperienced with the publishing process on Google play and App-store\nSolid understanding of object-oriented programming (OOP), SOLID principles and writing clean, well-structured testable code\nStrong knowledge of basic relational database and SQL concepts.\nExperienced in using reactive programming and aware of multi-threading concepts\nFamiliar with Flutter state-management tools ex. GetX, BloC, Provider, etc.\nAbility to write proper software documentation and working with other development sections\nAbility to self-learn new technologies and gain required skills to complete tasks on unexplored grounds\n","isSuitable":false},{"fullText":"About the job\nCompany Description\n\niSynclouds is a leading software development company in the Arab and Gulf market, with more than 10 years of success in manufacturing and developing software. Our focus is on software development and analysis, information systems, marketing and artificial intelligence fields.\n\n\nRole Description\n\nThis is a Full-time on-site Senior Flutter  role, located in Cairo, Egypt. As a Senior Flutter , you will be responsible for creating multi-platform apps for iOS and Android using Google's Flutter development framework. You will have a strong understanding of Flutter, Dart, and various mobile development platforms and be able to help develop, debug, and maintain high-quality mobile applications that meet business requirements.\n\n\nLocation: Cairo ,Nasr City\n\n\n\nTime Type: Full time\n\n\n\nQualifications\n\n3+ years Flutter mobile experience\nDesign and build advanced applications for the android & iOS platform\nSolid understanding of OOP design, algorithms, design patterns and programming skills\nDeep understanding of mobile app development principles, including UI\/UX design, performance optimization, and user interaction.\nDealing with APIs and utilizing REST \/ JSON interfaces\nWorking within Agile workflows and concepts\nWorking with Microsoft Azure DevOps for the assigned projects\nExperience in publishing process on both play store & app store\nProven work experience as a Flutter Designer or similar role for at least 3 years, regardless of the year of graduation.\nGood understanding of mobile development principles and best practices\nBachelor's degree in Computer Science or a related field.\nStrong understanding of the Flutter framework.\nAbility to work independently and as part of a team.\nAbility to solve problems and make decisions.\n\n\nWhat's on Offer?\n\n\n\nCompetitive salary.\nGreat work environment\nExcellent career development opportunities\nFlexible working options\n","isSuitable":false},{"fullText":"About the job\nWe are seeking FlutterFlow s to join our No-code Development team.\n\n\nSkills Required:\n1- Proven experience in Flutter development, including proficiency in Dart programming language.\n2- Experience with Firebase integrations\n3- Experience with implementing search functionalities within the app.\n4- Knowledge of integrating third-party APIs for additional functionalities.\n5- Experience in user authentication and handling user-generated content such as reviews.\n6- Solid problem-solving skills and attention to detail.\n7- Excellent communication and teamwork abilities.\n\n\n","isSuitable":false},{"fullText":"About the job\nDescription\nWe are looking for a Senior Front-End Web .\n\n\nResponsibilities\n\n• Build reusable code and libraries for future use\n• Optimize application for maximum speed and scalability\n• Assure that all user input is validated before submitting to back-end\n• Collaborate with other team members\n\n\nRequirements\nProficient understanding of web markup, including HTML5, CSS3\nPerfect understanding of server-side CSS pre-processing platforms, such as SCSS\nProficient understanding of client-side scripting and JavaScript frameworks\nGreat understanding of utility Frameworks such as Bootstrap, Tailwind, SemantiUI and others\nGreat understanding of JS Development Frameworks such as React\nGood understanding of asynchronous request handling, partial page updates, and AJAX\nProficient understanding of cross-browser compatibility issues and ways to work around them.\nProficient understanding of code versioning tools, such as Git\n","isSuitable":false},{"fullText":"About the job\nCompany Description\n\n\nSmart-Solution is a technology services company based in Cairo, Egypt. We offer a range of services including website and mobile application development, drop shipping, digital marketing, and production.\n\n\n\n\n\n\nRole Description\n\n\nWe are seeking a Senior Flutter  for a full-time on-site role in Cairo, Egypt. The Senior Flutter  will be responsible for the day-to-day tasks associated with developing and maintaining mobile applications using Flutter technology.\n\n\n\n\n\n\nQualifications\n\n\nExpertise in Flutter Development and Dart Programming\nStrong understanding of mobile application development principles\nAbility to write high-quality, clean, and maintainable code\nExperience working with RESTful APIs and third-party libraries and APIs\nExperience with Git or other version control tools\nFamiliarity with Agile development methodologies is a plus\nExcellent problem-solving skills\nStrong communication skills\nBachelor's or Master's degree in Computer Science or related field\n","isSuitable":false},{"fullText":"About the job\nAs a React JS and React Native  at Qeema Tech, you will play a key role in designing, developing, and maintaining high-quality software solutions. You will collaborate with cross-functional teams to deliver innovative web and mobile applications that meet our clients’ needs. This is an exciting opportunity to work on diverse projects and contribute to the success of a rapidly expanding company.\nJob Requirements:\n\n· Proven experience as a React JS and React Native \n· Strong proficiency in JavaScript, TypeScript, and React.js\n· Extensive experience in mobile app development using React Native\n· Solid understanding of state management with tools like Redux or MobX\n· Familiarity with RESTful APIs and GraphQL\n· Experience with version control systems such as Git\n· Knowledge of modern web and mobile design principles\n· Strong problem-solving and analytical skills\n· Excellent communication and teamwork skills\n· Ability to work in a fast-paced and collaborative environment\n· Bachelor’s degree in Computer Science or a related field (or equivalent work experience)\nJob Responsibilities:\n\n· Develop high-quality and responsive web applications using React.js\n· Build and maintain mobile applications for iOS and Android using React Native\n· Collaborate with cross-functional teams, including designers, product managers, and other s, to deliver high-quality software solutions\n· Participate in the entire application lifecycle, from concept and design to testing and deployment\n· Write clean, efficient, and maintainable code\n· Troubleshoot, debug, and resolve software defects and issues\n· Stay up-to-date with the latest industry trends and technologies to ensure the best practices are applied\n· Conduct code reviews to ensure code quality and adherence to coding standards\n· Work closely with the QA team to ensure software quality and performance\n· Contribute to the continuous improvement of development processes and methodologies\n","isSuitable":false},{"fullText":"About the job\n\n\nJob Description: \nWe are seeking a highly skilled Kotlin  to join our team at POS Mission. As an integral part of our development team, you will contribute to building cutting-edge solutions that enhance POS terminal operations in collaboration with our esteemed partner, Fawry. The ideal candidate should possess a strong foundation in software engineering principles, particularly in Kotlin development, and exhibit expertise in various technologies and patterns, with a preference for Functional Programming (FP) over Object-Oriented Programming (OOP).\n\n\n\n\nResponsibilities:\n\nApply software engineering best practices, including design patterns and SOLID principles, to architect and develop robust solutions.\nUtilize Test-Driven Development (TDD) methodologies to ensure high-quality code and software reliability.\nDesign and implement Room DB structures with a focus on First Offline Approach to support seamless offline functionality.\nDemonstrate proficiency in multi-threading using coroutines, along with other techniques such as Flow and LiveData for reactive programming paradigms.\nWillingness and enthusiasm to embrace Functional Programming (FP) concepts in coding, transitioning from Object-Oriented Programming (OOP) methodologies.\nExhibit adaptability by swiftly learning and implementing new technologies as required by the job.\n\n\n\n\nRequirements:\n\nMinimum 4+ years of hands-on experience as a Kotlin , showcasing proficiency in software engineering concepts.\nIn-depth understanding and practical application of design patterns, specifically the Gang of Four book's 23 patterns.\nStrong knowledge and practical application of SOLID principles in software design, with the ability to solve complex problems by applying each principle.\nFamiliarity with distributed system design, particularly using BLE technology, and an advantage if experienced with RxAndroidBle library.\nAbility to handle professional interviews focusing on software engineering problems and providing solutions based on patterns and SOLID principles.\n\n\n\n\nCompany Overview: \nPOS Mission is an international company that has recently established a presence in the Egyptian market. We pride ourselves on our strong partnership with Fawry, a collaboration aimed at revolutionizing POS terminal operations. Our mission is to drive innovation and efficiency in the field of payment solutions, leveraging cutting-edge technologies and strategic partnerships to deliver exceptional value to our clients and customers.\n \n\n \n\nAdditional Information:\n\nCompetitive salary starting at 40,000 Egyptian pounds, commensurate with experience, accompanied by various other benefits and opportunities.\nOpportunity for continued education: Our company offers a scholarship for a master's degree, supporting employees' aspirations for further education and professional growth.\n","isSuitable":false},{"fullText":"About the job\nCompany Description\n\nJawabkom is the largest platform for asking questions to experts in the Arab world, with millions of users and multiple awards. People use Jawabkom to get answers from verified experts in an affordable and timely manner. The website has been covered by over 50 newspapers and magazines in the Arab world and the United States, and is considered one of the fastest-growing Arabic websites.\n\n\nJob Description:\n\nWe are in search of a seasoned Senior Android  with a robust background in telecommunication and VOIP applications. With at least 5 years of hands-on experience in Android development, the ideal candidate will bring expertise and innovation to our dynamic team.\n\n\nKey Responsibilities:\n\n\n\nDevelop, optimize, and maintain Android applications focused on telephony and VOIP services.\nCollaborate with cross-functional teams to integrate telecommunication features.\nEnsure the performance, quality, and responsiveness of applications.\nDebug and resolve application issues and enhance application performance.\nParticipate in the entire application lifecycle, from concept to delivery.\n\n\nKey Requirements:\n\n\n\nMinimum 5 years of professional Android development experience.\nStrong knowledge of the Android SDK, Kotlin, and Dependency Injection.\nProven experience in telephony, telecommunication, and VOIP application development.\nFamiliarity with data streaming, RESTful APIs, and Google Billing Library.\nSolid understanding of Android UI design principles, patterns, and best practices.\nExperience with gRPC and unit testing frameworks.\nCommitment to writing clean, maintainable, and efficient code.\nStrong analytical skills and a problem-solving attitude.\nExcellent team collaboration and communication skills.\nBSc\/MSc in Computer Science, Engineering, or related field.\nThis role is perfect for a dedicated Android  who thrives in a fast-paced environment and is eager to work on innovative telecommunication solutions. Join us and contribute to the development of state-of-the-art VOIP applications and services.","isSuitable":false},{"fullText":"About the job\nJob Responsibilities:\n\nDeliver high-quality code to digital products for clients with various technologies.\nResponsible for the delivery of projects from source-code to the deployment of binaries on production.\nGenerate\/Update Solution Design Document.\nParticipate with the sales team in preparing the technical proposals.\nContribute in the transformation from Monolithic Architecture to Microservices Architecture.\nDevelop complex backend applications\/APIs for digital channels (like Web and Mobile) with demands for performance, uptime, scalability, security and resiliency.\nDevelop a solution that can use Traditional Architecture, Containerization Architecture or both together.\nSupport his\/her team as well as other teams across the company in an AGILE environment.\nAssist and participate with Digital Product teams in understanding and building the needed solution.\nWrite code, fix errors, modify others code, adapt it to new hardware or improve its performance.\nReview code, and approve merge requests and be the owner of project’s master branch.\n\n\nJob Qualifications:\n\nBachelor's Degree (Engineering, Computer Science or related major).\n5+ years of working experience in enterprise projects with web and mobile interfaces.\nStrong knowledge of Java\/Java EE frameworks.\nSolid understanding of design patterns.\nJava EE open-source technology experience (Spring, Struts, JPA) is a MUST.\nSolid understanding of Relational DB concepts.\nExperienced with web services technologies, like: SOAP and REST.\nWorking experience with Application Servers (like WebSphere and WildFly).\nExperienced with message queuing and events streaming, like: MQ, Kafka, ESB, MQTT, PubSub, etc.\nWorking experience in microservices and\/or serverless solutions.\nStrong understanding to DevOps fundamentals and Agile methodologies.\nFamiliarity with CI\/CD toolchain. (Git, Jenkins, Artifactory, etc.).\nGood knowledge of No-SQL databases is a PLUS.\nStrong understanding of Multi-tier and Event-Driven Architecture.\nGood knowledge of Kubernetes, OpenShift and AWS Architecture.\nGood Awareness on Application Security aspects, like (OWASP, PCI, OAuth, SSL, etc.).\n","isSuitable":false},{"fullText":"About the job\nMid level  - 3 years to 5 years experience\nAdvance level  - 5 years to 9 years experience\nJob Location\nRemote (full-time) position.\n\n\n\n\nRequirements:\n\nShould have good experience in Core PHP, Laravel, and Mysql.\nStrong object-oriented programming skills.\nExperience in writing effective RESTful APIs.\nKnowledge of multiple front-end languages and libraries (e.g. HTML\/ CSS, JavaScript, jQuery, etc).\nThis person should have strong analytical skills and should have good communication and interpersonal skills.\nTake full responsibility for task\/project execution.\nAbility to prioritize own work and respect deadlines.\nMust have good experience with git.\n\n\nHaving expertise in Coding is mandatory\n\n\nThe following are some key responsibilities:\n\nDesign and develop scalable and secure web applications using Laravel\nWrite clean, maintainable, and testable code\nCollaborate with the development team to implement new features and fix bugs\nParticipate in code reviews and contribute to the development of best practices\nStay up-to-date with the latest web development technologies and trends\nTroubleshoot and debug application issues\nKnowledge of security best practices in web development.\nOptimize application performance, troubleshoot bottlenecks, and implement solutions.\n","isSuitable":false},{"fullText":"About the job\n⁦\nSummary:\n\nThe iOS Native  is responsible for developing and maintaining high-quality iOS native apps. This role works closely with the product team to understand the product vision and requirements, and then designs and implements features that meet those requirements. The iOS Native  also works with the QA team to test and debug apps before they are released to production.\nResponsibilities:\n\nDevelop and maintain high-quality iOS native apps.\nDesign and implement new features.\nWork with the product team to understand the product vision and requirements.\nWork with the QA team to test and debug apps.\nOptimize apps for performance and battery life.\nStay up-to-date on the latest iOS development trends and technologies.\nQualifications:\n\nBachelor's degree in Computer Science or a related field.\n3+ years of experience in developing and maintaining iOS native apps.\nStrong understanding of iOS development concepts and technologies, including Swift, Objective-C, Xcode, and Cocoa Touch.\nExperience with designing and implementing user interfaces.\nExperience with testing and debugging iOS apps.\nExperience with integrating with third-party APIs and services.\nPreferred Qualifications:\n\nExperience with developing for different iOS devices and screen sizes.\nExperience with human interface design (HID).\nExperience with unit testing and integration testing.\nExperience with continuous integration and continuous delivery (CI\/CD).\n","isSuitable":true},{"fullText":"About the job\nProCrew is a professional employer organization and software kitchen. Since 2012, ProCrew has worked in multiple fields like software development, marketing, and operations.\nWe're uniquely situated to help shape how companies grow their businesses in the digital age and aid them in being able to do so properly with the right people. We work with big, innovative brands like LamasaTech (UK), an award-winning B2B technology provider, Diyafa-group (KSA), Ocucon (UK) becoming the largest provider of video analytics services, and IAmProperty (UK) trusted by more than 2500 Estate Agents.\n\n\nWe are looking for an iOS  who possesses a passion for pushing mobile technologies to the limits and will work with our team of talented engineers to design and build the next generation of our mobile applications.Responsibilities\nDesign and build advanced applications for the iOS platform\nCollaborate with cross-functional teams to define, design, and ship new features.\nUnit-test code for robustness, including edge cases, usability, and general reliability.\nWork on bug fixing and improving application performance.\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency.\nRequirements and skills\nBS\/MS degree in Computer Science, Engineering or a related subject\nProven working experience in software development at least 5 years.\nWorking experience in iOS development\nHave published one or more iOS apps in the app store\nProficient in Objective-C, Swift, and Cocoa Touch.\nExperience working with iOS frameworks such as Core Data, Core Animation, Core Graphics and Core Text\nExperience with third-party libraries and APIs\nWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologies\nSolid understanding of the full mobile development life cycle\n","isSuitable":true},{"fullText":"About the job\n**Must submit a resume in English, Work hours in CET**\n\nFluency in English is a MUST.\n\n\n\nWe are looking for an iOS  who can create an infrastructure for iOS app development and lead the whole process. Your primary focus will be the development of iOS applications and their integration with back-end services \n\n\n\nResponsibilities: \n\n - Design and build applications for the iOS platform \n\n- Ensure the performance, quality, and responsiveness of applications \n\n- Collaborate with a team to define, design, and ship new features \n\n- Identify and correct bottlenecks and fix bugs \n\n- Help maintain code quality, organization, and automatization\n \n\nRequirements : \n\n- 5+ years’ experience developing mobile applications for iOS platforms. \n\n- Proficient with Swift programming \n\n- Experience with iOS frameworks such as Core Data, Core Animation, etc. \n\n- Experience with offline storage, threading, and performance tuning \n\n- Familiarity with RESTful APIs to connect iOS applications to back-end services \n\n- Knowledge of other web technologies and UI\/UX standards \n\n- Understanding of Apple’s design principles and interface guidelines \n\n- Familiarity with cloud message APIs and push notifications \n\n- Proficient understanding of code versioning tools such as Git \n\n","isSuitable":true},{"fullText":"About the job\nWe are looking for an iOS  responsible for the development and maintenance of applications aimed at a range of iOS devices including mobile phones. Your primary focus will be development of iOS applications and their integration with backend services. You will be working alongside other engineers and s working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential.\n\n\nResponsibilities:\n\n\n\nBuild innovative product features. \nConduct code reviews to ensure a code of the highest quality.\nUnit-test code for robustness, including edge cases, usability, and general reliability.\nTake part in planning meetings with a truly agile team to break down user stories into technical tasks.\nProvide increasingly accurate estimations for the tasks to be done.\nCollaborate with other s, product managers, designers, and QA engineers to deliver the best product possible.\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency.\n\n\nQualifications:\n\n\n\nBachelor’s degree or higher in Computer Science or a related field.\n4-8 years of experience in the development of iOS apps that use web services (for example with REST and JSON).\nExperience with Swift and Plus Objective-C.\nExpert knowledge of the iOS SDK (UIKit, Storyboards, Core Animation, Core Data, Auto-layout).\nA strong understanding of design patterns.\nExtensive knowledge of Unit Testing frameworks, ideally some understanding of Automation testing.\nKnowledge about with newly release updates from Apple, Swift UI, Widgets, AppClips is a great addition.\nHave published one or more iOS apps in the app store.\nKnowledge about continuous integration systems.\nExpert knowledge of asynchronous programming (GCD, NSOperationQueue, Promises).\nKnowledge about different design architecture MVC, MVVM, MVP, VIPRE.\nExperience with git or other version control systems.\nExperience with dependency managers e.g: CocoaPods, Swift Package Manager, Carthage.\n","isSuitable":true},{"fullText":"About the job\nWe are looking for an iOS  who possesses a passion for pushing mobile technologies to the limits and will work with our team of talented engineers to design and build the next generation of our mobile applications\n\n\nResponsibilities:\n\nDesign and build advanced applications for the iOS platform\nCollaborate with cross-functional teams to define, design, and ship new features.\nUnit-test code for robustness, including edge cases, usability, and general reliability.\nWork on bug fixing and improving application performance.\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency.\n\n\nRequirements:\n\nBS\/MS degree in Computer Science, Engineering or a related subject\nProven working experience in software development\n4+ years of experience in iOS development\nHave published one or more iOS apps in the app store\nA deep familiarity with Objective-C and Cocoa Touch\nExperience working with iOS frameworks such as Core Data, Core Animation, Core Graphics and Core Text\nExperience with third-party libraries and APIs\nWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologies\nSolid understanding of the full mobile development life cycle\n","isSuitable":true},{"fullText":"About the job\nResponsibilities\n\n \nDesign and start development of our iOS application.\nCollaborate with cross-functional teams to define, design, and ship new features.\nWork on bug fixing and improving application performance.\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency.\nEnsure the best possible performance, quality, and responsiveness of the application.\nRequirements:\n\n \nProduct and technical-focused iOS application development experience 5+ years.\nUp to date with the latest Swift and iOS trends like SwiftUI and new concurrency models.\nKnowledge and understanding of the operation of basic algorithms and data structures.\nExperience in working with \/ implementing backend-driven UI.\nUnderstanding and deep-dive knowledge of UIKit, SwiftUI, Core Animation, MVI, Networking.\nUnderstanding of analytics and performance metrics.\nExperience working with CI\/CD pipelines.\nExperience working with UI\/Unit testing.\nExcellent understanding of OOP and design patterns.\nExperience performance profiling with instruments in Xcode.\n","isSuitable":true},{"fullText":"About the job\nThe Role\n\nWe are seeking a highly skilled and experienced Lead\/Senior iOS Engineer to join our dynamic and innovative team. The successful candidate will play a crucial role in the development and enhancement of our iOS applications, ensuring they meet the highest standards of performance, reliability, and user experience. As a Lead\/Senior iOS Engineer, you will collaborate with cross-functional teams, lead iOS development initiatives, and contribute to the overall success of our mobile applications.\n \nResponsibilities\n\niOS App Development: Lead end-to-end development, testing, and maintenance of high-quality iOS applications.\nTechnical Leadership: Provide guidance and mentorship to junior iOS s, fostering a collaborative environment.\nArchitecture and Design: Contribute to architectural decisions, ensuring scalability, maintainability, and performance.\nCode Review: Conduct thorough reviews to maintain code quality, consistency, and best practices adherence.\nCross-functional Collaboration: Work closely with product managers, designers, and engineers to deliver high-quality solutions.\nInnovation: Stay current with iOS trends, actively contributing ideas to enhance functionality, performance, and user experience\nBug Fixing and Optimization: Identify and address bugs and performance issues, ensuring a seamless user experience.\nDocumentation: Create and maintain technical documentation for iOS applications.\nRequirements:\n\nBachelor's degree in Computer Science, Software Engineering, or a related field.\n5+ years of professional experience as an iOS Engineer with a strong portfolio of successfully delivered iOS applications.\nExpertise in Swift and Objective-C programming languages.\nSolid understanding of iOS frameworks, architecture patterns, and best practices.\nExperience with version control systems (e.g., Git) and CI\/CD pipelines.\nProficient in working with remote data via REST and JSON.\nExperience with third-party libraries.\nStrong problem-solving and debugging skills.\nExcellent communication and collaboration skills.\nDemonstrated ability to lead and mentor a team of iOS s.\nFamiliarity with agile development methodologies.\nNice to Have:\n\n· Experience with SwiftUI.\nExperience with Structured Concurrency.\nExperience with Automated UI Testing.\nIf you are a passionate and seasoned iOS engineer with a minimum of 5 years of experience, who is looking to make a significant impact in the healthcare field, we encourage you to apply.\n","isSuitable":true},{"fullText":"About the job\nAbout Atos\n\n\n\nAtos is a global leader in digital transformation with 107,000 employees and annual revenue of over € 11 billion. European number one in cybersecurity, cloud and high-performance computing, the Group provides tailored end- to-end solutions for all industries in 71 countries. A pioneer in decarbonization services and products, Atos is committed to a secure and decarbonized digital for its clients. Atos is a SE (Societies Europaea), listed on Euronext Paris and included in the CAC 40 ESG and Next 20 Paris Stock indexes.\n\n\nThe purpose of Atos is to help design the future of the information space. Its expertise and services support the development of knowledge, education, and research in a multicultural approach and contribute to the development of scientific and technological excellence. Across the world, the Group enables its customers and employees, and members of societies at large to live, work and develop sustainably, in a safe and secure information space.\n\n\nWhat You’ll Be Doing\n\n\n\nCore Responsibilities\n\n\n\n· Writing clean, functional, maintainable code and following coding best practices and standards.\n· Implement user interfaces and ensure their responsiveness, efficiency, and adherence to design guidelines.\n· Design, develop, and maintain both new and existing code.\n· Test new and existing code by creating, maintaining, and running unit.\n· Troubleshoot, solve complex problems, and create innovative solutions.\n· Strong track record of delivering against deadlines.\n· Participate in the design and creation of scalable software.\n· Collaborating with other s and project teams to understand project requirements and contribute to the development process.\n· Collaborate with cross-functional teams, such as designers and backend s, to integrate frontend and backend components.\n· Participate in design reviews with peers and stakeholders to decide amongst available technologies.\n· Support, advice, and coach other s.\n· Coordinate with other teams on implementations and dependencies e.g.API’s & SDKs\n· Set up, develop, test, and deploy to environments and processes.\n· Engage in the creation and refinement of user stories.\n· Document technical specifications, code comments, and user guides for developed applications.\n· Make sure of security and data protection settings.\n· Assure high-quality software deliveries.\n \nExperience & Qualification\n\n\n\n· Bachelor of Science degree (or equivalent) in computer science, engineering, or relevant field\n· Proven professional experience as an iOS , with a strong portfolio of iOS applications.\n· Strong knowledge of mobile apps architecture patterns, such as MVC, MVVM, or VIPER, and experience in applying them to iOS app development\n· In-depth knowledge of iOS frameworks such as UIKit, SwiftUI, Combine, Core Data, Core Animation, Core Graphics, and others.\n· Strong understanding of software engineering principles, including object-oriented programming, design patterns, and modularization\n· Proficiency in using Interface Builder to design and develop visually appealing and responsive user interfaces.\n· Proficiency in debugging, troubleshooting, and performance optimization of iOS applications using Xcode debugging tools and Instruments.\n· Experience with CoreData or other database frameworks to manage complex data models and perform data operations efficiently.\n· Solid understanding of RESTful APIs and experience in integrating them into iOS applications, handling data parsing, and asynchronous operations\n· Understanding of performance optimization techniques, including memory management, code profiling, and optimizing app launch times\n· Knowledge of security best practices in iOS app development, including secure data storage, encryption, and keychain usage\n· Experience with localization and internationalization of iOS applications to support multiple languages and regions.\n· Familiarity with Agile project management tools like Jira for task tracking and project collaboration\n· Familiarity with Apple's App Store submission process, guidelines, and requirements\n· Experience in mentoring and providing technical leadership to a development team.\n· Strong analytical and problem-solving skills, with the ability to tackle complex technical challenges and propose innovative solutions.\n· Experience with continuous integration and deployment tools such as Jenkins, Fastlane, or Bitrise to streamline the development and release process.\n","isSuitable":true},{"fullText":"About the job\nDescription\n\nSwenson He is a fast-growth, Inc 5000 software firm that designs and engineers custom mobile and web solutions. As a full-service agency, we provide product guidance, technical strategy implementation and ongoing support for mid-market and startup companies needing highly specialized technology. Our award-winning solutions have made us a top-rated firm with expertise in Media & Entertainment, E-commerce, Fintech, Healthcare, and Internet of Things (IoT). Our modern offices are in Los Angeles, CA and Dallas, TX.\nDriven by the philosophy that strong mobile technology changes lives in meaningful ways, it is our goal that each one of our projects advances this cause. We believe that each member of our Swenson He team is critical to fulfilling this mission. Therefore, we provide an exciting and encouraging environment for you to be highly impactful, working with top level designers, engineers and support staff to create cutting edge solutions.\nWe are looking for an experienced iOS Engineer to join our top-level, growing team. As an important member of the engineering team, you will have the opportunity to work independently within a supportive group on technically challenging problems. You will be developing next generation iOS applications for innovative clients. This is an exciting and challenging opportunity for the right candidate to make a real impact.\n\n\n\n\nWHAT WILL YOU DO?\n\nArchitect large scale, functional mobile applications from a wireframe\/full manual\nDevelop high impact Swift code and relevant functional\/unit tests\nResponsible for technically architecting full-featured iOS applications that interact with in-house and third-party APIs\nManage and update existing code bases\nUtilize source control management such as Git\nCollaborate with other s: backend, iOS, Android and management to develop high quality products\nRequirements\n\nA minimum 4-6 years of full-time recent experience with iOS\nStrong custom UI capabilities\nMedia search capabilities\nExpertise with Swift 4\nExpertise with REST\/JSON\nStrong micro-animation capabilities\nMVVM and MVC architecture\n\n\n \n\nBenefits\n\nIt's on-demand contractor job, with hourly rate.\n","isSuitable":true},{"fullText":"About the job\nBlackStone eIT, a leading computer software company, is seeking a highly skilled Senior iOS  to join our dynamic team. As a Senior iOS , you will be responsible for designing and developing advanced iOS applications for our clients. You will work closely with a talented team of s, designers, and product managers to deliver innovative and user-friendly mobile solutions.\n\nResponsibilities\n\nDesign and build advanced applications for the iOS platform\nCollaborate with cross-functional teams to define, design, and ship new features\nUnit-test code for robustness, usability, and reliability\nWork on bug fixing and improving application performance\nMaintain code quality, organization, and automatization\nStay updated with the latest industry trends, mobile technologies, and development best practices\nProvide technical guidance and mentorship to junior s\n\nRequirements\n\nBachelor's degree in Computer Science or a related field\nMinimum of 5 years of experience in iOS development\nProficiency in Swift and Objective-C programming languages\nStrong understanding of the iOS SDK and frameworks such as UIKit, Core Data, and Core Animation\nExperience with RESTful APIs and JSON\nSolid understanding of the full mobile development life cycle\nExperience with Git, Jira, or other version control and project management tools\nKnowledge of performance optimization techniques and debugging tools for iOS\nAbility to work independently and in a team environment\nExcellent problem-solving and analytical skills\nStrong communication and collaboration abilities\n\nBenefits\n\nPaid Time Off\nWork From Home\nPerformance Bonus\nTraining & Development\n","isSuitable":true},{"fullText":"About the job\nCompany Description\n\nSalamtak Group is a healthcare provider that has developed an application to establish a connection between healthcare seekers and providers, ensuring high efficiency and saving time, effort, and cost. The Salamtak app and website provide a range of healthcare services that raise the level of healthcare services in the region.\n \nRole Description\n\nAs a Senior iOS  at Salamtak Group, you will be responsible for developing, testing, and maintaining mobile applications for iOS that meet the needs of Salamtak's users. Your role will require you to work closely with our team of s to create high quality, reliable, and scalable software solutions. This is a full-time on-site position located in Giza, 6th October city.\n \nQualifications\n\n· +3 years proven working extensive experience developing native iOS applications using Swift UI and UIKi\n· Strong knowledge of Xcode, Interface Builder, and CocoaPods\n· Familiar with modern architectures (MVP, MVVM, VIPER, etc.)\n· Experience in performance profiling with Instruments on Xcode\n· Experience in designing, developing, testing, deploying and maintaining highly performant, secure, and scalable mobile applications\n· Familiarity with RESTful APIs to connect mobile applications to back-end services.\n· Excellent problem-solving and communication skills, with the ability to manage multiple tasks simultaneously and work in a fast-paced, dynamic environment\n· Bachelor's degree in computer science or a related field. Master's degree in computer science is a plus.\n· Experience with developing applications for healthcare or similar data-sensitive domains is preferred\n","isSuitable":true},{"fullText":"About the job\nMain Job Responsibilities \/ Duties :\nDesign and build advanced applications for the IOS platform.\nCollaborate with cross-functional teams to define, design, and ship new features.\nUnit-test code for robustness, including edge cases, usability, and general reliability.\nWork on bug fixing and improving application performance.\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency.\nEnsure the performance, quality, and responsiveness of applications\nSupport the entire application lifecycle (concept, design, test, release, and support ).\nExperience working with IOS frameworks such as Core Data, Core Animation, and Core Graphics.\nDeep Understanding of MVC design patterns.\nIdentify and correct bottlenecks and fix bugs.\nWrite unit and UI tests to identify malfunctions.\nTroubleshoot and debug to optimize performance.\nKeep up to date on the latest industry trends in mobile technologies\nJob Requirements:\nBS\/MS degree in Computer Science, Engineering, or a related subject\nProven working experience in software development\nWorking experience in iOS development\nHave published one or more iOS apps in the app store\nExperience with iOS-specific languages, frameworks, and tools such as Swift, Core Data, Cocoa Touch, Core Animation, and Core Graphics.\nExperience with third-party libraries and APIs\nWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologies.\nImplement native iOS app Solid understanding of the full mobile development life cycle.\nExperience with commonly used third-party libraries and services (e.g. GraphQL, Alomafire, firebase, Google Maps).\nProficient understanding of code versioning tools (such as Git)\nFamiliarity with cloud message APIs and push notifications\nFamiliarity with RESTful APIs to connect iOS applications to back-end services \nExperience with offline storage, threading, performance tuning and memory management\nFamiliarity with SOLID principles and design patterns to make code maintainable, readable, scalable\n","isSuitable":true},{"fullText":"About the job\nRole Brief:\n\nYou are responsible for designing and coding the base application, ensuring the quality of the application, fixing application bugs, maintaining the code, and implementing application updates for our IOS mobile version.\n\nWhat you will be working on here in Koinz:\n\nContribute to iOS application development cycle including system architecture, module design, and quality assurance.\nCollaborating with the product team to define app features.\nImplement complex designs into reliable, reusable, and readable code. \nUse best engineering practices and automated continuous integration and delivery within an Agile environment.\nParticipate in validating user requirements, estimating the needed efforts, and setting release plans. \nHelp maintain code quality, organization, and automatization.\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency.\n\nWhat you will need to fit in this position:\n\nHold a university degree in Computer Engineering, Computer Science, or equivalent.\nHaving relative experience is a must.\niOS Development using XCode and Swift programming language.\nDeep Git knowledge.\nStrong OOP and iOS Design patterns knowledge.\nData structures and Algorithms strong grasp.\nUML and other design graphing tools.\nJira project management platform.\nUI\/UX design background.\n","isSuitable":true},{"fullText":"About the job\nJob Requirements\n\nDesign and develop iOS-compatible mobile applications\nIdentify and fix bugs before the final release\nMaintain the code and atomization of the application\nBachelor’s degree in computer science, information technology, or equivalent discipline\nA minimum of 3 years of experience in mobile development (IOS)\nStrong knowledge of Swift, and Cocoa Touch\nExperience with design patterns and object-oriented concepts\nAnalyze, design, and document software applications\nLocation: Nasr City \nFlexible work environment\n","isSuitable":true},{"fullText":"About the job\nQualifications:\n\n2-4 years experience with designing, building, and maintaining complex mobile apps on iOS\nProficiency in Swift \nStrong hands-on experience in iOS SDK, different versions of iOS, and how to deal with different screen sizes\nStrong hands-on experience in mobile application development tools and environments\nHave contributed to one or more Apps that are available on the App Store.\nStrong experience in iOS application architecture, design and development\nProficient understanding of code versioning tools such as Git\nStrong experience in Apple services.\nStrong experience in Google Maps SDK.\nSolid understanding of RESTful APIs and how to connect iOS applications to back-end services.\nKnowledge about CI\/CD systems\nAbility to understand business requirements and translate them into technical requirements\n\n\nBonus Qualifications\n\nExperience in Swift UI.\nExperience in working with Real Time-communication sdk (pubnub).\nExperience in sqlite.\nImplementing payment functionalities.\n","isSuitable":true},{"fullText":"About the job\nAre you a “Senior IOS ” Looking for a unique challenge? Unleash your protentional by joining one of the biggest companies in the Middle East.\n\nJob Summary\n\nResponsible for developing applications for the IOS platform and participating in the entire application life-cycle.\nResponsibilities\n\nBeing involved in all stages of application development including design, modifications, development, and implementation of IOS applications to insure the application quality and efficiency\nDocumenting all codes of the development processes to record and facilitate the work for other mobile s\nKeeping up to date with the latest industry trends in mobile technologies to enhance the application functionality\nWriting clean code\nWorking with graphic designers and software s to realize, build, and test the applications and to implement server APIs (Application Programming Interface) and services to support planned mobile functionality\nJob Requirements\n\nQualifications & Work Experience\n\nBachelor’s degree in any field, preferably computer science or engineering\n3+ years of relevant experience\nGood command of both written and spoken English\nExperience with Swift, Objective-C, Cocoa, Xcode, , XML and JSON\nExperience with design patterns and object-oriented concept\nExperience with Core Data and Core Animation\nExperience with offline storage, threading, and performance tuning\nProficient understanding of code versioning tools (such as Git, Mercurial or SVN)\nFamiliarity with RESTful APIs to connect iOS applications to back-end services\nUnderstanding of Apple’s design principles and interface guidelines\nDeploying apps process on App Store\n","isSuitable":true},{"fullText":"About the job\nWe're Hiring a 𝐌𝐢𝐝-𝐒𝐞𝐧𝐢𝐨𝐫 𝐢𝐎𝐒 𝐄𝐧𝐠𝐢𝐧𝐞𝐞𝐫 at TrianglZ LLC!\n\nTrianglZ LLC, a leading software development and outsourcing services company based in Alexandria, Egypt, is looking for a talented and experienced Mid-Senior iOS Engineer to join our team. If you have a passion for developing cutting-edge iOS applications and are proficient in SwiftUI and UIKit, we would love to hear from you!\n\nTasks\n\nDevelop high-quality iOS applications using Swift, SwiftUI, and UIKit\nCollaborate with cross-functional teams to define, design, and ship new features\nOptimize application performance, security, and stability\nTroubleshoot and resolve software bugs and technical issues\nStay up-to-date with the latest trends and technologies in iOS app development\n\n\nRequirements\n\n2+ years of experience in iOS development\nproficiency with Swift, SwiftUI, and UIKi\nStrong knowledge of Xcode, Interface Builder, and CocoaPods\nExperience with RESTful APIs and integrating them with iOS applications\nFamiliarity with iOS frameworks such as Core Data, Core Animation, etc.\nFamiliar with modern architectures (MVP, MVVM, VIPER, etc)\nExperience working with Git version control and Unit testing and Continuous Integration\nExperience in performance profiling with Instruments on Xcode\nA positive disposition and a good attitude under pressure\nExcellent problem-solving skills and attention to detail\nStrong communication and teamwork abilities\nAlexandria Resident.\n\n\nBenefits\n\nCompetitive salary and benefits package.\nProductive environment.\nCasual environment.\nHybrid Model.\nFlexible vacation and time off policies.\nProfessional development opportunities.\n\n\nApply Now! Don't miss the opportunity!\n","isSuitable":true},{"fullText":"About the job\nRole Brief:\n\nYou are responsible for designing and coding the base application, ensuring the quality of the application, fixing application bugs, maintaining the code, and implementing application updates for our IOS mobile version.\n\nWhat you will be working on here in Koinz:\n\nContribute to iOS application development cycle including system architecture, module design, and quality assurance.\nCollaborating with the product team to define app features.\nImplement complex designs into reliable, reusable, and readable code. \nUse best engineering practices and automated continuous integration and delivery within an Agile environment.\nParticipate in validating user requirements, estimating the needed efforts, and setting release plans. \nHelp maintain code quality, organization, and automatization.\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency.\n\nWhat you will need to fit in this position:\n\nHold a university degree in Computer Engineering, Computer Science, or equivalent.\nHaving relative experience is a must.\niOS Development using XCode and Swift programming language.\nDeep Git knowledge.\nStrong OOP and iOS Design patterns knowledge.\nData structures and Algorithms strong grasp.\nUML and other design graphing tools.\nJira project management platform.\nUI\/UX design background.\n","isSuitable":true},{"fullText":"About the job\nMain Job Responsibilities \/ Duties :\n\nDesign and build advanced applications for the IOS platform.\nCollaborate with cross-functional teams to define, design, and ship new features.\nUnit-test code for robustness, including edge cases, usability, and general reliability.\nWork on bug fixing and improving application performance.\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency.\nEnsure the performance, quality, and responsiveness of applications\nSupport the entire application lifecycle (concept, design, test, release, and support ).\nExperience working with IOS frameworks such as Core Data, Core Animation, and Core Graphics.\nDeep Understanding of MVC design patterns.\nIdentify and correct bottlenecks and fix bugs.\nWrite unit and UI tests to identify malfunctions.\nTroubleshoot and debug to optimize performance.\nKeep up to date on the latest industry trends in mobile technologies\n\n\nJob Requirements:\n\nBS\/MS degree in Computer Science, Engineering, or a related subject\nProven working experience in software development\nWorking experience in iOS development\nHave published one or more iOS apps in the app store\nEnsure familiarity with Objective-C\nExperience working with iOS frameworks such as Core Data, Core Animation, Core Graphics, and Core Text\nExperience with third-party libraries and APIs\nWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologies.\nImplement native iOS app Solid understanding of the full mobile development life cycle.\nPlication using Objective-C.\nExperience with commonly used third-party libraries and services (e.g. AFNetworking, Alomafire, Google Maps, SDWebImage, SWRevealViewController).\nUp to speed with iOS 10 changes, new features, and requirements\nC# Knowledge\nIntegrating Web Services OR web API using JSON\/XML, c\nKnowledge of SQLite\n","isSuitable":true},{"fullText":"About the job\nCompany Description\nLink Development is a leading global technology solutions provider that is pioneering the digitalization of private and public sectors. With over 20 years of expertise, more than 500 professionals and thousands of successful engagements across different industries, we are focused on government, telecom, healthcare, finance, real estate, and education. We offer comprehensive digital strategy and roadmaps that help our customers take the digital leap. We are committed to driving business transformation while delivering integrated, inventive, and digitally productive experiences that blend cloud, analytics, mobility, smart services, Dynamics 365 - CRM\/ERP, infrastructure, IOT, augmented reality, and others.\n\nRole Description\nWe are looking for an experienced IOS Technical Lead to join our dynamic team. This is a full-time hybrid role that is based in Cairo, with some work from home flexibility. As an IOS Technical Lead, you will be responsible for leading our IOS development team, providing technical expertise to drive the development and delivery of high-quality IOS applications, and ensuring best practices are followed. You will work closely with the project team to develop technical project plans, manage project timelines, and help to scope project requirements. You will also collaborate with cross-functional teams to identify business opportunities, provide customized solutions, and ensure the delivery of successful IOS projects.\n\nQualifications\nBachelor's degree or higher in Computer Science or a related field\n7+ years of experience in IOS application development\nExpertise in Swift, Objective-C, and Xcode\nExperience in Agile methodologies and using Git, Jira, or Bitbucket\nExperience in client-facing roles and managing teams\nStrong organizational and project management skills\nExcellent communication skills in English\nAbility to work under pressure and manage multiple projects simultaneously\nPassion for keeping up-to-date with emerging trends and new technologies in IOS development\n","isSuitable":true},{"fullText":"About the job\nWe are hiring iOS  5 years’ experience\n \n iOS  Responsibilities:\n\n- Designing and building mobile applications for Apple’s iOS platform.\n- Collaborating with the design team to define app features.\n- Ensuring quality and performance of the application to specifications.\n- Identifying potential problems and resolving application bottlenecks.\n- Fixing application bugs before the final release.\n -Publishing application on App Store.\n- Maintaining the code and atomization of the application.\n- Designing and implementing application updates.\n\n\n iOS  Requirements:\n\n- Bachelor’s degree in computer science or software engineering.\n- Proven experience as an app .\n- Proficient in Objective-C, Swift, and Cocoa Touch.\n- Extensive experience with iOS Frameworks such as Core Data and Core Animation.\n- Knowledge of iOS back-end services.\n- Knowledge of Apple’s design principles and application interface guidelines.\n- Proficient in code versioning tools including Mercurial, Git, and SVN.\n- Knowledge of C-based libraries.\n- Familiarity with push notifications, APIs, and cloud messaging.\n- Experience with continuous integration.\n- Biometric login\n- Apple Health, Fitbit, Strava.\n- Forms Dynamicity.","isSuitable":true},{"fullText":"About the job\nResponsibilities:\niOS App Development: Design, develop, test, and maintain iOS applications that meet the company's objectives and user needs.\nCoding Excellence: Write clean, maintainable, and efficient code following industry best practices and design patterns.\nPerformance Optimization: Identify and address performance bottlenecks and ensure apps are optimized for speed and responsiveness.\nCollaboration: Collaborate closely with product managers, designers, and fellow s to transform requirements into technical specifications and implement features.\nCode Reviews: Participate in code reviews to maintain code quality and provide constructive feedback to team members.\nBug Fixing: Investigate and resolve issues promptly, ensuring the smooth operation of the applications.\nAPI Integration: Integrate with external APIs and third-party libraries to enhance app functionality.\nStay Current: Keep abreast of the latest iOS trends, tools, and technologies and share your knowledge with the team.\nMentorship: Mentor junior s and contribute to the growth and knowledge sharing within the iOS development team\n","isSuitable":true},{"fullText":"About the job\nAre you an “iOS ” Looking for a unique challenge? Unleash your protentional by joining one of the biggest companies in the Middle East.\n\n\nJob Summary\nResponsible for developing applications for the IOS platform and participating in the entire application life-cycle.\nResponsibilities \n\nBeing involved in all stages of application development including design, modifications, development, and implementation of IOS applications to insure the application quality and efficiency\nDocumenting all codes of the development processes to record and facilitate the work for other mobile s\nKeeping up to date with the latest industry trends in mobile technologies to enhance the application functionality\nWriting clean code\nWorking with graphic designers and software s to realize, build, and test the applications and to implement server APIs (Application Programming Interface) and services to support planned mobile functionality\n\n\nRquirments:\n\nBachelor’s degree in any field, preferably computer science or engineering\n1+ years of relevant experience\nGood command of both written and spoken English\nExperience with Swift, Objective-C, Cocoa, Xcode, HTML, XML and JSON\nExperience with design patterns and object-oriented concept\nExperience with Core Data and Core Animation\nExperience with offline storage, threading, and performance tuning\nProficient understanding of code versioning tools (such as Git, Mercurial or SVN)\nFamiliarity with RESTful APIs to connect iOS applications to back-end services\nUnderstanding of Apple’s design principles and interface guidelines\nDeploying apps process on App Store\n\n\nBenifits:\n\nCasual and productive environment\nCompetitive salary\nSocial insurance\nMedical coverage\nFlexible working hours\n","isSuitable":true},{"fullText":"About the job\nCompany Description\n\nWe suggest you enter details here.\n\n\nRole Description\n\nWe are looking for an iOS  responsible for the development and maintenance of applications aimed at a range of iOS devices including mobile phones and tablet computers.\nYour primary focus will be the development of iOS applications and their integration with back-end services.\nYou will be working alongside other engineers and s working on different layers of the infrastructure.\nTherefore, a commitment to collaborative problem-solving, sophisticated design, and the creation of quality products is essential\n\n\nResponsibilities\n\nDesign and build applications for the iOS platform\nEnsure the performance, quality, and responsiveness of applications\nCollaborate with a team to define, design, and ship new features\nIdentify and correct bottlenecks and fix bugs\nHelp maintain code quality, organization, and automatization\n\n\nQualifications\n\nExpertise in Mobile Application Development and iOS Development\nStrong knowledge of Mobile Applications development in iOS\nExtensive experience in Software Development\nExperience with iOS frameworks such as UIKit, Core Animation, etc.\nExperience with Swift or Objective-C programming language\nExperience with RESTful APIs, third-party libraries, and API integration\nUnderstanding of Apple's design principles and interface guidelines\nBachelor’s or Master’s degree in Computer Science, or a similar field\n","isSuitable":true},{"fullText":"About the job\nWe are hiring iOS  5 years’ experience.\n\n\n IOS  Responsibilities:\n\n· Designing and building mobile applications for Apple’s iOS platform.\n· Collaborating with the design team to define app features.\n· Ensuring quality and performance of the application to specifications.\n· Identifying potential problems and resolving application bottlenecks.\n· Fixing application bugs before the final release.\n· Publishing application on App Store.\n· Maintaining the code and atomization of the application.\n· Designing and implementing application updates.\n \n \nIOS  Requirements:\n\n· Bachelor’s degree in computer science or software engineering.\n· Proven experience as an app .\n· Proficient in Objective-C, Swift, and Cocoa Touch.\n· Extensive experience with iOS Frameworks such as Core Data and Core Animation.\n· Knowledge of iOS back-end services.\n· Knowledge of Apple’s design principles and application interface guidelines.\n· Proficient in code versioning tools including Mercurial, Git, and SVN.\n· Knowledge of C-based libraries.\n· Familiarity with push notifications, APIs, and cloud messaging.\n· Experience with continuous integration.\n· Biometric login\n· Apple Health, Fitbit, Strava.\n· Forms Dynamicity.\n","isSuitable":true},{"fullText":"About the job\n Responsibilities:\n\n\n\n- Design and build applications for the iOS platform\n- Ensure the performance, quality, and responsiveness of applications\n- Collaborate with a team to define, design, and ship new features\n- Identify and correct bottlenecks and fix bugs\n- Help maintain code quality, organization, and automatization.\n- Work on improving application performance.\n- Continuously discover, evaluate, and implement new technologies to maximize development efficiency.\n \nRequired skills:\n\n \n\n- Proficient with Objective-C or Swift\n- +3 Years proven experience with iOS frameworks such as Core Data, Core Animation, etc.\n- Experience with offline storage, threading, and performance tuning\n- Familiarity with RESTful APIs to connect iOS applications to back-end services\n- Knowledge of other web technologies and UI\/UX standards\n- Understanding of Apple’s design principles and interface guidelines\n- Knowledge of low-level C-based libraries is preferred\n- Experience with performance and memory tuning with tools Familiarity with cloud message APIs and push notifications\n- Knack for benchmarking and optimization\n- Proficient understanding of code versioning tools\n- Familiarity with continuous integration\n- Solid Time management and reliability. (Able to accurately predict turnaround time on projects and deliver on those timelines)\n- Strong Team Player\n","isSuitable":true},{"fullText":"About the job\nJob Description\n\nStrong technical background, good knowledge of Xcode, Cocoa frameworks such as Core Data, Core Animation, Core Graphics, Core Audio and Core Text. Strong command over Swift and Objective C.\nWorking knowledge of the general mobile landscape, architectures, trends and emerging technologies.\nExperience with third-party libraries and APIs.\nComfortable in Storyboard and Playground.\nAndroid experience is an added advantage.\nStrong command over Web APIs & Social media\nTeam handling experience is an added advantage.\nTests their own code before sending it to QC.\nSets up a development environment on his \/ her own.\n\n\nJob Requirements\n\n• More than 1 year of experience. \n\n• Bachelor’s degree in Computer Science or Software Engineering.\n• Proven experience as an app .\n• Objective C is a plus.\n• Proficient in Swift, and Cocoa Touch.\n• Design and build advanced applications for the iOS platform.\n• Client Interaction.\n• To collaborate with cross-functional teams to define, design and ship new features.\n• To generate wireframes.\n• To design, develop, test and implement an iOS application as well as continue production of new versions of the application.\n• Design solutions independently.\n• Unit-test code for robustness, including edge cases, usability and general reliability.\n• Work on bug fixing and improving application performance.\n• Operates effectively in a fast paced, deadline driven, collaborative and iterative\n• Programming environment.\n","isSuitable":true},{"fullText":"About the job\nSenior Ios  is required for Software company in Mansoura (Moltaqa Tech)\nResponsibilities\n\nWhat You’ll Be Doing:\n\nDesign and build advanced applications for the iOS platform.\nCollaborate with cross-functional teams to define, design, and ship new features.\nUnit-test code for robustness, including edge cases, usability, and general reliability.\nWork on bug fixing and improving application performance.\nContinuously discover, evaluate, and implement new technologies to maximize development\nefficiency.\nQualifications:\n\nBSc degree in Engineering, Computer Science or relevant field.\nProven working experience in Mobile development (At Least 2 Years of experience).\nA deep familiarity with (Core Competencies, Swift, Rxswift, Combine, Xcode, CI\/CD,\nMVVM\/MVP\/MVC)\nFully aware of Source code management (GIT).\nFully aware of Firebase (Notification, Firestore, Database Realtime).\nExperience with Google Maps Api.\nWorking experience in iOS development (Swift Language).\nExperience working with iOS frameworks such as Core Data, Core Graphics and Core Text.\nExperience with third-party libraries and APIs, and Postman.\nFully aware of the full mobile development life cycle.\nFully aware of the agile methodologies.\nFamiliarity with content management systems.\nExcellent analytical and time management skills.\nTeamwork skills with a problem-solving attitude.\no Please send your resume on hr@moltaqa.net\n","isSuitable":true},{"fullText":"About the job\nJob Title: iOS  \nWe are hiring iOS  5 years’ experience \n\n \niOS  Responsibilities: \n\nDesigning and building mobile applications for Apple’s iOS platform. \n\nCollaborating with the design team to define app features. \n\nEnsuring quality and performance of the application to specifications. \n\nIdentifying potential problems and resolving application bottlenecks. \n\nFixing application bugs before the final release. \n\nPublishing application on App Store. \n\nMaintaining the code and atomization of the application. \n\nDesigning and implementing application updates. \n\niOS  Requirements: \n\nBachelor’s degree in computer science or software engineering. \n\nProven experience as an app . \n\nProficient in Objective-C, Swift, and Cocoa Touch. \n\nExtensive experience with iOS Frameworks such as Core Data and Core Animation. \n\nKnowledge of iOS back-end services. \n\nKnowledge of Apple’s design principles and application interface guidelines. \n\nProficient in code versioning tools including Mercurial, Git, and SVN. \n\nKnowledge of C-based libraries. \n\nFamiliarity with push notifications, APIs, and cloud messaging. \n\nExperience with continuous integration. \n\nBiometric login \n\nApple Health, Fitbit, Strava. \n\nForms Dynamicity.\n","isSuitable":true},
        {"fullText":"About the job\nJob Responsibilities:\n\n• Design and build applications for iOS mobile.\n• Ensure the performance, quality, and responsiveness of applications.\n• Identify and correct bottlenecks and fix bugs.\n• Help maintain code quality, organization, and automation.\n\n\nSkills Required:\n\n • A Solid Understanding of the iOS platform.\n • Proficient with Swift language.\n • Experience with iOS frameworks such as Core Data, Core Animation, Core Graphics, and Core Text.\n • Experience with Design with coding is a must.\n • Experience with RxSwift is a must.\n • Experience with offline storage, threading, and performance tuning.\n • Experience with Google Maps, and Google Places.\n • Experience with performance and memory tuning with tools.\n • Familiarity with Unit testing, CI\/CD.\n • Familiarity with different architectural patterns like MVVM, and VIPER.\n • Familiarity with RESTful APIs to connect iOS applications to back-end services.\n • Familiarity with cloud message APIs and push notifications.\n • Knowledge of other web technologies and UI\/UX standards.\n • Understanding of Apple’s design principles and interface guidelines.\n • Proficient understanding of code versioning tools such as Git.\n\n\nRequired Qualification:\n\n • BS\/MS degree in Software Engineering\/ \n\n\nRequired Experience:\n\n • The candidate should have at least 4 years of proven experience as an IOS .\n • The candidate must have a strong portfolio\n","isSuitable":true},{"fullText":"About the job\nRole Purpose\nAs a Junior iOS , you will be responsible for helping to design, develop, and maintain our mobile applications for iOS devices.\n\n\nKey Accountabilities And Decision Ownership\nWorks with the development team to design and develop iOS applications\nWrites clean, efficient, and well-documented code\nAssists in debugging and troubleshooting issues that arise during development and testing\nCollaborates with designers to ensure that our iOS applications are visually appealing and easy to use\nRemains up-to-date with the latest iOS development trends and technologies\nParticipates in code reviews and contributes to the development of best practices \n\n\nCore Competencies, Knowledge, and Experience\n\n\nAttention to details\nExcellent problem solving skills\nAdvanced technical and analytical skills\nStrong oral and written communication skills\n\nMust Have Technical \/ Professional Qualifications\nBachelor's degree in computer science or any relevant field \n1-2 years of experience in iOS development \nProficiency in Swift and Objective-C programming languages\nExperience with iOS development tools such as Xcode and Interface Builder\nFamiliarity with Apple's development frameworks, such as UIKit and Core Data\nUnderstanding of software development best practices, such as version control, code reviews, and testing\n","isSuitable":true},{"fullText":"About the job\nJob Description\nDesign and build advanced applications for the iOS platform\nCollaborate with cross-functional teams to define, design, and ship new features.\nUnit-test code for robustness, including edge cases, usability, and general reliability.\nWork on bug fixing and improving application performance.\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency.\n\n\nJob Requirements\nBS\/MS degree in Computer Science, Engineering or a related subject\nProven working experience in software development\nWorking experience in iOS development\nHave published one or more iOS apps in the app store\nA deep familiarity with Objective-C and Cocoa Touch\nExperience working with iOS frameworks such as Core Data, Core Animation, Core Graphics and Core Text\nExperience with third-party libraries and APIs\nWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologies\nSolid understanding of the full mobile development life cycle\n","isSuitable":true},{"fullText":"About the job\nWe are looking for an iOS  who is passionate for pushing mobile technologies to the limits. \n\nThe candidate will work with other app s and technical teams to design and build the next generation of our mobile applications.\n\n\nJob Requirements\nProven working experience in software development\nWorking experience in iOS development\nA deep familiarity with Swift\nExperience working with iOS frameworks such as Core Data, Core Animation, Core Graphics and Core Text\nExperience with third-party libraries and APIs\nExperience working with remote data via REST and JSON\nWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologies\nSolid understanding of the full mobile development life cycle\n\n\n","isSuitable":true},{"fullText":"About the job\nWe are seeking to hire \"Senior IOS \" for one of our clients.\n\n\nMain Responsibilities:\n• Design and build applications for the iOS platform\n• Ensure the performance, quality, and responsiveness of applications\n• Identify and correct bottlenecks and fix bugs\n\n\nSkills:\n• Background in e-commerce\/fintech.\n• Proficient with Swift\n• Experience with iOS frameworks such as Core Data, Core Animation, etc.\n• Experience with offline storage, threading, and performance tuning\n• Familiarity with RESTful APIs to connect iOS applications to back-end services\n• Knowledge of other web technologies and UI\/UX standards\n• Familiarity with cloud message APIs and push notifications\n• Proficient understanding of code versioning tools {{such as Git, Mercurial or SVN}}\n• Experience with game development is a plus\n• Familiarity with Firebase.\n• Fluent in English is a must.\n• Understanding of testing and test-driven development.\n• 3 years of Experience with task management Software’s (Trello…).\n• Must have +3 years of work experience for a commercial company \n\n\n\nFor interested candidates, kindly send your updated CV to S.ashraf@infinitybs-eg.com and please mention the title in the subject\n","isSuitable":true},{"fullText":"About the job\nWhat You'll Do\nDesign, code, analyze, and test systems for iOS applications.\n Identify and correct bottlenecks and fix bugs\nDesign and build advanced, scalable applications in SwiftUI.\nWrite high-quality, performant, and reliable code while working on defined tasks\/bugs independently.\nWork with the product and design teams to understand end-user requirements and use cases, and translate them into pragmatic and effective technical solutions.\nUnit-test code for robustness including edge cases, usability, and general reliability.\n\n\nWhat You'll Need\n2+ years of iOS application development with extensive use of Swift\nFull understanding of the mobile development life cycle. Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies.\nStrong understanding of interactive application development paradigm under iOS, memory management, file I\/O, network programming, concurrency and multithreading, and publishing iOS apps in the Appstore.\nReactive programming (RxSwift\/Combine) is necessary.\nExcellent debugging skills.\n\n\nPreferred Qualifications\nExperience with SwiftUI and structured concurrency.\nWorking knowledge of developing scalable SDKs and libraries.\nExperience applying professional software engineering best practices, including coding standards, code reviews, source control management, build processes, testing, and operations.\n\n\n","isSuitable":true},{"fullText":"About us: \n\n4Sale is one of the largest online marketplaces in the Middle East, and easily Kuwait's largest marketplace. We connect millions of users to hundreds of thousands of listings on any given day, through our mobile apps as well as our website: http:\/\/q84sale.com. \n\n\n\nWe’re established, profitable, and comfortably fund our own expansion with no outside help. \n\n\n\nWhile most of our customer base is located in the Gulf, the bulk of 4Sale’s headcount actually operates and makes decisions out of none other than Zamalek, Cairo, where we have a beautiful office, and employ some of the most impressive people in Egypt’s Tech landscape. \n\nWe’re already winning in Kuwait, but to us the sky’s the limit and we won’t stop innovating on behalf of our customers. \n\n\n\nTo that end, we’re expanding our business lines and breadth of operations, and of course we’re constantly refining our products so that they are seamless, fun, and useful. This is not easy to do! In fact, it’s a ton of work. Which is why we need the most talented people in the country to come and help us out. After all, our mission is to Become the largest online marketplace in the Middle East.\n\n\nWe’re pretty selective though, so expect to be challenged and stretched. Also, expect to be in the office with us a lot - we can only build great products if we’re actually together. We only hire exceptional people, so if you think you’re one of us, go ahead and apply - see you at the interview! \n\n\n\nAbout You:\n\nIf you’re a great fit at 4Sale, then you’re most likely intense, ambitious, energetic, and have an endless thirst for achievement. \n\n\n\nYou love challenges, embrace difficulties, hate wasting time, and only want to join a place if it means you’re making history. \n\n\n\nYou walk through fire to get the job done. There is no skill or tool that you will not master if it means making our products better. In short, you are exceptional. \n\n\n\nResponsibilities: \n\nDesign, build, test, and deploy iOS applications working throughout the entire lifecycle of the app from idea to delivery \nGive priority to documentation and spends time to maintain, update and extend existing repositories of knowledge. \nMentor, coach and support other team members to achieve team’s goals. \nIdentifies & pragmatically applies better code practices to create a well-organized and optimized source code structure to achieve high code quality and reusability rates. \nCan Identify signs of debt, measure the time needed to reduce it, and create a plan. \nOptimize app performance and work on bug fixing and share knowledge with the team. \nEffectively communicate scaling\/reliability limits and lead discussions to all types of stakeholders from tech and non tech. \nDeliver large scale projects by leading chapter team members who are working on different cross functional squads. \nThinks critically about team practices & processes and regularly discusses improvements with leads & managers. \nUnderstands, adapt, and acts quickly with requirements changes without frustration. \n\n\nRequirements\/Qualifications: \nBachelor’s degree in computer science or engineering from a reputable university. \nExperience developing iOS applications using Swift and SwiftUI. \nSolid experience in dealing with the iTunes app store. \nStrong experience building and working with RESTful APIs. \nUnderstanding accessibility and security compliance. \nExcellent debugging skills. \nSolid architectural & design pattern experience. \nHigh level of communication skills dealing with different types of stakeholders. \nShould be flexible and can research and quickly adapt to new technologies. \nAbility to work under stress and tight deadlines is a must. \nAbility to jump in legacy code and understand it quickly. \nHigh level of problem solving and decision-making skills.\n","isSuitable":true},{"fullText":"About the job\nWe are seeking to hire \"Senior IOS \" for one of our clients.\n\n\nMain Responsibilities:\n• Design and build applications for the iOS platform\n• Ensure the performance, quality, and responsiveness of applications\n• Identify and correct bottlenecks and fix bugs\n\n\nSkills:\n• Background in e-commerce\/fintech.\n• Proficient with Swift\n• Experience with iOS frameworks such as Core Data, Core Animation, etc.\n• Experience with offline storage, threading, and performance tuning\n• Familiarity with RESTful APIs to connect iOS applications to back-end services\n• Knowledge of other web technologies and UI\/UX standards\n• Familiarity with cloud message APIs and push notifications\n• Proficient understanding of code versioning tools {{such as Git, Mercurial or SVN}}\n• Experience with game development is a plus\n• Familiarity with Firebase.\n• Fluent in English is a must.\n• Understanding of testing and test-driven development.\n• 3 years of Experience with task management Software’s (Trello…).\n• Must have +3 years of work experience for a commercial company (Full-Time).\n\n\nFor interested candidates, kindly send your updated CV to \"omar.kamal@infinitybs-eg.com\" and please mention the title in the subject\n","isSuitable":true},{"fullText":"About the job\n\n\nJob Responsibilities:\n\n\n\nDesign and build high-quality mobile applications for the iOS platform\nEnsure scalability and performance of the applications\nPerform testing and fix application bugs where necessary\nCollaborate across teams to define other features and functionalities\n\n\nJob Requirements:\n\n\n\nExperience of not less than 3 years\nHe has projects on the Apple Store\nBachelor’s\/Master’s degree in Computer Science (or equivalent experience)\nMust be experienced in iOS and Swift\nProficiency with APIs, Data Access, and UI development\nGood understanding of the iOS framework\nFamiliarity with Apple’s design principles and interface guidelines\n","isSuitable":true},{"fullText":"About the job\nFor a reputable company, I'm seeking to hire Senior IOS  with a background in e-commerce\/fintech\nMain Responsibilities: \n\n• Design and build applications for the iOS platform\n • Ensure the performance, quality, and responsiveness of applications\n • Identify and correct bottlenecks and fix bugs Skills:\n • Proficient with Swift\n • Experience with iOS frameworks such as Core Data, Core Animation, etc.\n • Experience with offline storage, threading, and performance tuning \n\n• Familiarity with RESTful APIs to connect iOS applications to back-end services\n • Knowledge of other web technologies and UI\/UX standards \n\n• Familiarity with cloud message APIs and push notifications \n\n• Proficient understanding of code versioning tools {{such as Git, Mercurial or SVN}}\n • Experience with game development is a plus\n • Familiarity with Firebase.\n Minimum Qualifications\n - Bachelor’s degree in business admin\/Marketing or any related field.\n -Fluent in English is a must. • Understanding of testing and test-driven development.\n-3 years of Experience with task management Software’s (Trello…).\n- Must have +3 years of work experience for a commercial company\n","isSuitable":true},{"fullText":"Senior iOS \n\nJob Description\n\n We are looking for an iOS  responsible for the development and maintenance of applications aimed at a range of iOS devices including mobile phones and tablet computers. His primary focus will be development of iOS applications and their integration with back-end services. You will be working alongside other engineers and s working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential.\nSkills and Responsibilities: \n\n· Design and build applications for the iOS platform\n· Ensure the performance, quality, and responsiveness of applications\n· Collaborate with a team to define, design, and ship new features\n· Identify and correct bottlenecks and fix bugs\n· Help maintain code quality, organization, and automation\n· A deep familiarity with Objective-C , Swift, and Cocoa Touch\n· Experience with iOS frameworks such as Core Data, Core Animation, etc.\n· Experience with offline storage, threading, and performance tuning\n· Familiarity with RESTful APIs and SOUP services to connect iOS applications to back-end services\n· Experience with third-party libraries and APIs\n· Knowledge of other web technologies and UI\/UX standards\n· Understanding of Apple’s design principles and interface guidelines\n· Knowledge of low-level C-based libraries is preferred \n\n· Experience with performance and memory tuning with tools\n· Familiarity with cloud message APIs and push notifications\n· Familiarity with continuous integration\nRequirements:\n\n· BS\/MS degree in Computer Science, Engineering or a related subject\n· 5+ years’ experience in iOS development. \n\n· Excellent teamwork skills\n","isSuitable":true},{"fullText":"About the job\nSenior Ios  is required for Software company in Mansoura (Moltaqa Tech)\nResponsibilities\n\nWhat You’ll Be Doing:\n\nDesign and build advanced applications for the iOS platform.\nCollaborate with cross-functional teams to define, design, and ship new features.\nUnit-test code for robustness, including edge cases, usability, and general reliability.\nWork on bug fixing and improving application performance.\nContinuously discover, evaluate, and implement new technologies to maximize development\nefficiency.\nQualifications:\n\nBSc degree in Engineering, Computer Science or relevant field.\nProven working experience in Mobile development (At Least 2 Years of experience).\nA deep familiarity with (Core Competencies, Swift, Rxswift, Combine, Xcode, CI\/CD,\nMVVM\/MVP\/MVC)\nFully aware of Source code management (GIT).\nFully aware of Firebase (Notification, Firestore, Database Realtime).\nExperience with Google Maps Api.\nWorking experience in iOS development (Swift Language).\nExperience working with iOS frameworks such as Core Data, Core Graphics and Core Text.\nExperience with third-party libraries and APIs, and Postman.\nFully aware of the full mobile development life cycle.\nFully aware of the agile methodologies.\nFamiliarity with content management systems.\nExcellent analytical and time management skills.\nTeamwork skills with a problem-solving attitude.\no Please send your resume on mohamed@moltaqa.net\n","isSuitable":true},{"fullText":"About the job\nSmart Technology Solutions, is a company that provides businesses and people with information technology support services. We have a huge client base in the MENA region, with our headquarters in Jeddah and offices in Riyadh and Africa.\nOur senior management staff is mostly made up of people who have worked here in junior positions. We'll provide you with not only a job but also an environment in which you may learn and grow. We're looking for people that are passionate about Learning, Training, development, help, Support, internal team service, and Customer Service. people who know how to have fun but also deliver great results. People who can embrace change easily and be very committed and determined.\nIf this sounds like you, then we want you!\n\n\nSummary:\n\nWe are seeking an experienced Senior iOS  to join our dynamic team. In this role, you will be responsible for designing, developing, and maintaining high-performance, scalable, and secure iOS applications that provide an exceptional user experience to our customers.\n\n\nWhat Are Your Duties?\n\nDesign, develop, and maintain iOS applications using Swift or Objective-C.\nCollaborate with cross-functional teams to identify and implement new features.\nOptimize application performance and scalability.\nEnsure the security and reliability of iOS applications.\nWrite clean, maintainable, and well-documented code.\nStay up-to-date with emerging trends and technologies in iOS development.\n\n\nQualifications:\n\nBachelor's degree in Computer Science or a related field.\nMinimum of 5 years of experience in iOS development.\nProficiency in Swift or Objective-C.\nExperience with iOS frameworks like UIKit, CoreData, and CoreAnimation.\nStrong knowledge of iOS SDK and Xcode.\nExperience with Git version control.\nAbility to write high-quality, well-tested code.\nExcellent problem-solving and communication skills.\nStrong team player with the ability to work independently.\nPreferred:\nExperience with RESTful APIs and JSON.\nFamiliarity with Apple's Human Interface Guidelines.\nKnowledge of CI\/CD processes and tools.\nFamiliarity with Agile development methodologies.\nIf you meet the above requirements and are passionate about iOS development, we encourage you to apply for this exciting opportunity. We offer competitive salary packages, benefits, and a dynamic work environment that fosters growth and learning.\n\n\nWhat we Offer:\n\nCompetitive salary based on experience and qualifications.\nFull on-the-job training & support.\nFun working environment and culture.\nGreat opportunity for advancement.\n\n\n#We See Equal at SMART:\n\nAt our organization, we value diversity and are an equal-opportunity employer. Our employees come from a wide range of backgrounds, experiences, and perspectives. We'd want to include yours as well. Are you prepared to dazzle us with your brilliant ideas?\n\n\nOur Core Values:\n\nDELIVER WOW THROUGH SERVICE\nEMBRACE AND DRIVE CHANGE\nCREATE FUN AND A LITTLE WEIRDNESS\nBE ADVENTUROUS, CREATIVE, AND OPEN-MINDED\nPURSUE GROWTH AND LEARNING\nBUILD OPEN AND HONEST RELATIONSHIPS WITH HUMAN COMMUNICATION\nBUILD A POSITIVE TEAM AND FAMILY SPIRIT\nDO MORE WITH LESS\nBE PASSIONATE AND DETERMINED\nBE HUMBLE\n\n\nOur Vision:\n\nWe are an Extremely Trusted & Fun Technology Provider, with a humanly WoW Service that always exceeds our client’s expectations. We add value to our employees, suppliers, and clients and are their family and friends. Our services will cover the Middle East and Africa. And we will be dominating the IT Services for Small & Mid-sized businesses in terms of the number of satisfied clients. We want to be from well-known companies that have great cultures and working environments.\n","isSuitable":true},{"fullText":"About the job\nJob Description:\n\nDesigning and building mobile applications for Apple’s iOS platform.\nCollaborating with the business team to define app features.\nEnsuring quality and performance of the application to specifications.\nIdentifying potential problems and resolving application bottlenecks.\nFixing application bugs before the final release.\nPublishing applications on App Store.\nMaintaining the code and atomization of the application.\nDesigning and implementing application updates.\n\n\nJob Requirements:\n\nBachelor’s degree in computer science or software engineering.\nMinimum 4 years of Proven experience as an iOS app  (has apps samples published on App store)\nKnowledge of OOP and design patterns as MVVM.\nProficient in Objective-C, Swift, Swift-UI, and Combine.\nGood experience with iOS Frameworks such as Core Data and Core Animation.\nKnowledge of iOS back-end services.\nKnowledge of Apple’s design principles and application interface guidelines.\nProficient in code versioning tools including Git & Bitbucket\nKnowledge of C-based libraries.\n\n\nWork Terms:\n\nSunday to Thursday\nOn-site and Remotly are available\n","isSuitable":true},{"fullText":"\nIOS  \n\nWe’re looking for an experienced IOS . The role will design, develop on the iOS mobile platform.\n\n\nJob Description\n\n\nExperience with Swift\nPublished one or more apps on App Store\nA diverse portfolio of previously built iOS apps\nExperience with iOS native frameworks\nExperience with offline storage, threading, and performance tuning\nExperience with memory management\nExcellent debugging skills to solve challenging problems\nExperience integrating with RESTful API's\nExperience with version control with Git\nKnowledge of open source libraries and dependency management tools\nUnderstanding of iOS design principles and interface guidelines\nFamiliarity with cloud message APIs and push notifications\n\n\nSalary + Bonuses \n\nFlexible hour\nFulltime Work\n\n\nLocation : Nasrcity\nsend cv to jobs@sahlsolution.com \n\n","isSuitable":true},{"fullText":"About the job\nJob Summary\n\nResponsible for developing applications for the IOS platform and participating in the entire application life-cycle.\nResponsibilities\n\nBeing involved in all stages of application development including design, modifications, development, and implementation of IOS applications to insure the application quality and efficiency\nDocumenting all codes of the development processes to record and facilitate the work for other mobile s\nKeeping up to date with the latest industry trends in mobile technologies to enhance the application functionality\nWriting clean code\nWorking with graphic designers and software s to realize, build, and test the applications and to implement server APIs (Application Programming Interface) and services to support planned mobile functionality\nJob Requirements\n\nQualifications & Work Experience\n\nBachelor’s degree in any field, preferably computer science or engineering\n3+ years of relevant experience\nGood command of both written and spoken English\nExperience with Swift, Objective-C, Cocoa, Xcode, HTML, XML and JSON\nExperience with design patterns and object-oriented concept\nExperience with Core Data and Core Animation\nExperience with offline storage, threading, and performance tuning\nProficient understanding of code versioning tools (such as Git, Mercurial or SVN)\nFamiliarity with RESTful APIs to connect iOS applications to back-end services\nUnderstanding of Apple’s design principles and interface guidelines\nDeploying apps process on App Store\n\n\nBenefits\n\nCasual and productive environment\nCompetitive salary\nSocial insurance\nMedical coverage\nFlexible working hours\n","isSuitable":true},{"fullText":"About the job\n🔹 4 to 6 years of mobile iOS technical experience.\n🔹 Solid experience in OOP concepts.\n🔹 Practical experience developing iOS Development.\n🔹 In-depth experience with iOS architecture components\n(MVVM, MVP, VIP, VIPER is a plus) and functional reactive programming (R×Swift, Flow).\n🔹 In-depth experience with Swift Combine framework.\n🔹 Solid practical experience with different design patterns.\n🔹 Solid experience with continuous integration and delivery as well as test-driven development.\n🔹 Familiarity with RESTful APIs to connect Mobile applications to back-end services.\n🔹 Familiarity with external devices integration and control using 3rd party SDKs and APIs.\n🔹 Proactive self-starter with a positive mindset, an excellent sense of ownership, and a drive to learn and engage.\n🔹 Excellent verbal and written communications, interpersonal and analytical skills.\n🔹 Experience in SwiftUl is a good plus.\n🔹 FinTech (Banking) experience a plus.\n","isSuitable":true}
]
